ch2/ch2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-08-28 Fri 08:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Structure and Interpretation of Computer Programs (SICP)</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Robert Irelan" />
</head>
<body>
<div id="content">
<h1 class="title">Structure and Interpretation of Computer Programs (SICP)</h1>
