ch2/ch2.org
*** 2.3.1: Quotation

**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%25_thm_2.53][Exercise 2.53.]]
#+NAME: ex-2-53-test
#+BEGIN_SRC scheme
  (test '(a b c)
        (list 'a 'b 'c))
  (test '((george))
        (list (list 'george)))
  (test '((y1 y2))
        (cdr '((x1 x2) (y1 y2))))
  (test '(y1 y2)
        (cadr '((x1 x2) (y1 y2))))
  (test #f
        (pair? (car '(a short list))))
  (test #f
        (memq 'red '((red shoes) (blue socks))))
  (test '(red shoes blue socks)
        (memq 'red '(red shoes blue socks)))
#+END_SRC

**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%25_thm_2.54][Exercise 2.54.]]
#+NAME: ex-2-54
#+BEGIN_SRC scheme
  (define (my-equal? a b)
    (cond ((not (and (pair? a) (pair? b)))
           (eq? a b))
          ((and (pair? a) (pair? b))
           (and (my-equal? (car a) (car b))
                (my-equal? (cdr a) (cdr b))))
          (else #f)))
#+END_SRC

#+NAME: ex-2-54-test
#+BEGIN_SRC scheme
  (test #t
        (my-equal? '(this is a list) '(this is a list)))
  (test #f
        (my-equal? '(this is a list) '(this (is a) list)))
#+END_SRC

**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%25_thm_2.55][Exercise 2.55.]]

When this expression is evaluated, the outer ~quote~ is stripped, but the inner
one remains, giving the observed result, ~quote~.


