ch2/ch2.html
<div class="outline-text-3" id="text-orgheadline75">
</div><div id="outline-container-orgheadline66" class="outline-4">
<h4 id="orgheadline66"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%_sec_2.3.1">2.3.1: Quotation</a></h4>
<div class="outline-text-4" id="text-orgheadline66">
</div><div id="outline-container-orgheadline63" class="outline-5">
<h5 id="orgheadline63"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%_thm_2.53">Exercise 2.53.</a></h5>
<div class="outline-text-5" id="text-orgheadline63">
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock1"><span style="color: #707183;">(</span>test '<span style="color: #7388d6;">(</span>a b c<span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span>list 'a 'b 'c<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test '<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>george<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span>list <span style="color: #909183;">(</span>list 'george<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test '<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>y1 y2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span>cdr '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>x1 x2<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>y1 y2<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test '<span style="color: #7388d6;">(</span>y1 y2<span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span>cadr '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>x1 x2<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>y1 y2<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>pair? <span style="color: #909183;">(</span>car '<span style="color: #709870;">(</span>a short list<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>memq 'red '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>red shoes<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>blue socks<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test '<span style="color: #7388d6;">(</span>red shoes blue socks<span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span>memq 'red '<span style="color: #909183;">(</span>red shoes blue socks<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline64" class="outline-5">
<h5 id="orgheadline64"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%_thm_2.54">Exercise 2.54.</a></h5>
<div class="outline-text-5" id="text-orgheadline64">
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock2"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">my-equal?</span> a b<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>not <span style="color: #907373;">(</span><span style="color: #a020f0;">and</span> <span style="color: #6276ba;">(</span>pair? a<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>pair? b<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>eq? a b<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #a020f0;">and</span> <span style="color: #907373;">(</span>pair? a<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>pair? b<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span><span style="color: #a020f0;">and</span> <span style="color: #907373;">(</span>my-equal? <span style="color: #6276ba;">(</span>car a<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>car b<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span>my-equal? <span style="color: #6276ba;">(</span>cdr a<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>cdr b<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span> #f<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock3"><span style="color: #707183;">(</span>test #t
      <span style="color: #7388d6;">(</span>my-equal? '<span style="color: #909183;">(</span>this is a list<span style="color: #909183;">)</span> '<span style="color: #909183;">(</span>this is a list<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test #f
      <span style="color: #7388d6;">(</span>my-equal? '<span style="color: #909183;">(</span>this is a list<span style="color: #909183;">)</span> '<span style="color: #909183;">(</span>this <span style="color: #709870;">(</span>is a<span style="color: #709870;">)</span> list<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline65" class="outline-5">
<h5 id="orgheadline65"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%_thm_2.55">Exercise 2.55.</a></h5>
<div class="outline-text-5" id="text-orgheadline65">
<p>
When this expression is evaluated, the outer <code>quote</code> is stripped, but the inner
one remains, giving the observed result, <code>quote</code>.
</p>
</div>
</div>
</div>
