ch2/ch2.html

<div id="outline-container-orgheadline67" class="outline-4">
<h4 id="orgheadline67"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%_sec_2.3.2">2.3.2: Example: Symbolic Differentiation</a></h4>
<div class="outline-text-4" id="text-orgheadline67">
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock4"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Provided in the book</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">variable?</span> x<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>symbol? x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">same-variable?</span> v1 v2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>variable? v1<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>variable? v2<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>eq? v1 v2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">=number?</span> exp num<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>number? exp<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>= exp num<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-sum</span> a1 a2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>=number? a1 0<span style="color: #709870;">)</span> a2<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>=number? a2 0<span style="color: #709870;">)</span> a1<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #a020f0;">and</span> <span style="color: #907373;">(</span>number? a1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>number? a2<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>+ a1 a2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span> <span style="color: #709870;">(</span>list '+ a1 a2<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-product</span> m1 m2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #a020f0;">or</span> <span style="color: #907373;">(</span>=number? m1 0<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>=number? m2 0<span style="color: #907373;">)</span><span style="color: #709870;">)</span> 0<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>=number? m1 1<span style="color: #709870;">)</span> m2<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>=number? m2 1<span style="color: #709870;">)</span> m1<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #a020f0;">and</span> <span style="color: #907373;">(</span>number? m1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>number? m2<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>* m1 m2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span> <span style="color: #709870;">(</span>list '* m1 m2<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">sum?</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>pair? x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>eq? <span style="color: #709870;">(</span>car x<span style="color: #709870;">)</span> '+<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">addend</span> s<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr s<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">augend</span> s<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>caddr s<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">product?</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>pair? x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>eq? <span style="color: #709870;">(</span>car x<span style="color: #709870;">)</span> '*<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">multiplier</span> p<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr p<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">multiplicand</span> p<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>caddr p<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">deriv</span> exp var<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>number? exp<span style="color: #709870;">)</span> 0<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>variable? exp<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>same-variable? exp var<span style="color: #907373;">)</span> 1 0<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>sum? exp<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>make-sum <span style="color: #907373;">(</span>deriv <span style="color: #6276ba;">(</span>addend exp<span style="color: #6276ba;">)</span> var<span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>deriv <span style="color: #6276ba;">(</span>augend exp<span style="color: #6276ba;">)</span> var<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>product? exp<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>make-sum
           <span style="color: #907373;">(</span>make-product <span style="color: #6276ba;">(</span>multiplier exp<span style="color: #6276ba;">)</span>
                         <span style="color: #6276ba;">(</span>deriv <span style="color: #858580;">(</span>multiplicand exp<span style="color: #858580;">)</span> var<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>make-product <span style="color: #6276ba;">(</span>deriv <span style="color: #858580;">(</span>multiplier exp<span style="color: #858580;">)</span> var<span style="color: #6276ba;">)</span>
                         <span style="color: #6276ba;">(</span>multiplicand exp<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span>
         <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"unknown expression type -- DERIV"</span> exp<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
