ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%25_thm_2.56][Exercise 2.56.]]

We define the exponentiation procedure:

#+NAME: ex-2-56-exponentiation
#+BEGIN_SRC scheme
  (define (make-exponentiation b e)
    (cond ((=number? b 1) 1)
          ((=number? e 0) 1)
          ((=number? e 1) b)
          ((and (number? b) (number? e)) (expt b e))
          (else (list '** b e))))
  (define (base e) (cadr e))
  (define (exponent e) (caddr e))
  (define (exponentiation? e)
    (and (pair? e) (eq? (car e) '**)))
#+END_SRC

and then re-define the top-level ~deriv~ procedure to include exponentiation.

#+NAME: ex-2-56-deriv
#+BEGIN_SRC scheme
  (define (deriv exp var)
    (cond ((number? exp) 0)
          ((variable? exp)
           (if (same-variable? exp var) 1 0))
          ((sum? exp)
           (make-sum (deriv (addend exp) var)
                     (deriv (augend exp) var)))
          ((product? exp)
           (make-sum
             (make-product (multiplier exp)
                           (deriv (multiplicand exp) var))
             (make-product (deriv (multiplier exp) var)
                           (multiplicand exp))))
          ((exponentiation? exp)
           (let ((b (base exp))
                 (e (exponent exp)))
             (make-product
               (if (number? e)
                 (make-product
                   (exponent exp)
                   (make-exponentiation (base exp)
                                        (make-sum (exponent exp) -1)))
                 (error "Can't evaluate non-constant exponents"))
               (deriv (base exp) var))))
          (else
           (error "unknown expression type -- DERIV" exp))))
#+END_SRC

