ch2/ch2.html

<div id="outline-container-orgheadline68" class="outline-5">
<h5 id="orgheadline68"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%_thm_2.56">Exercise 2.56.</a></h5>
<div class="outline-text-5" id="text-orgheadline68">
<p>
We define the exponentiation procedure:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock5"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-exponentiation</span> b e<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>=number? b 1<span style="color: #709870;">)</span> 1<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>=number? e 0<span style="color: #709870;">)</span> 1<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>=number? e 1<span style="color: #709870;">)</span> b<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #a020f0;">and</span> <span style="color: #907373;">(</span>number? b<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>number? e<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>expt b e<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span> <span style="color: #709870;">(</span>list '** b e<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">base</span> e<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr e<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">exponent</span> e<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>caddr e<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">exponentiation?</span> e<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>pair? e<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>eq? <span style="color: #709870;">(</span>car e<span style="color: #709870;">)</span> '**<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
and then re-define the top-level <code>deriv</code> procedure to include exponentiation.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock6"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">deriv</span> exp var<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>number? exp<span style="color: #709870;">)</span> 0<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>variable? exp<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>same-variable? exp var<span style="color: #907373;">)</span> 1 0<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>sum? exp<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>make-sum <span style="color: #907373;">(</span>deriv <span style="color: #6276ba;">(</span>addend exp<span style="color: #6276ba;">)</span> var<span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>deriv <span style="color: #6276ba;">(</span>augend exp<span style="color: #6276ba;">)</span> var<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>product? exp<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>make-sum
           <span style="color: #907373;">(</span>make-product <span style="color: #6276ba;">(</span>multiplier exp<span style="color: #6276ba;">)</span>
                         <span style="color: #6276ba;">(</span>deriv <span style="color: #858580;">(</span>multiplicand exp<span style="color: #858580;">)</span> var<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>make-product <span style="color: #6276ba;">(</span>deriv <span style="color: #858580;">(</span>multiplier exp<span style="color: #858580;">)</span> var<span style="color: #6276ba;">)</span>
                         <span style="color: #6276ba;">(</span>multiplicand exp<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>exponentiation? exp<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>b <span style="color: #858580;">(</span>base exp<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
               <span style="color: #6276ba;">(</span>e <span style="color: #858580;">(</span>exponent exp<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>make-product
             <span style="color: #6276ba;">(</span><span style="color: #a020f0;">if</span> <span style="color: #858580;">(</span>number? e<span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>make-product
                 <span style="color: #80a880;">(</span>exponent exp<span style="color: #80a880;">)</span>
                 <span style="color: #80a880;">(</span>make-exponentiation <span style="color: #887070;">(</span>base exp<span style="color: #887070;">)</span>
                                      <span style="color: #887070;">(</span>make-sum <span style="color: #707183;">(</span>exponent exp<span style="color: #707183;">)</span> -1<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>error <span style="color: #8b2252;">"Can't evaluate non-constant exponents"</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>deriv <span style="color: #858580;">(</span>base exp<span style="color: #858580;">)</span> var<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span>
         <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"unknown expression type -- DERIV"</span> exp<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
