ch2/ch2.html

<div id="outline-container-orgheadline69" class="outline-5">
<h5 id="orgheadline69"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%_thm_2.57">Exercise 2.57.</a></h5>
<div class="outline-text-5" id="text-orgheadline69">
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock7"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-sum</span> a . as<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">rec</span> a as<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>null? as<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>list a<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>a1 a<span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>a2 <span style="color: #858580;">(</span>car as<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>arest <span style="color: #858580;">(</span>cdr as<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>=number? a1 0<span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>rec a2 arest<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>=number? a2 0<span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>rec a1 arest<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span><span style="color: #a020f0;">and</span> <span style="color: #80a880;">(</span>number? a1<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>number? a2<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>rec <span style="color: #80a880;">(</span>+ a1 a2<span style="color: #80a880;">)</span> arest<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #a020f0;">else</span>
                <span style="color: #858580;">(</span>cons a1 <span style="color: #80a880;">(</span>rec a2 arest<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>val <span style="color: #907373;">(</span>rec a as<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span><span style="color: #a020f0;">and</span> <span style="color: #907373;">(</span>pair? val<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>pair? <span style="color: #6276ba;">(</span>cdr val<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>cons '+ val<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>car val<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-product</span> m . ms<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">rec</span> m ms<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>null? ms<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>list m<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>m1 m<span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>m2 <span style="color: #858580;">(</span>car ms<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>mrest <span style="color: #858580;">(</span>cdr ms<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span><span style="color: #a020f0;">or</span> <span style="color: #80a880;">(</span>=number? m1 0<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>=number? m2 0<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>list 0<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>=number? m1 1<span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>rec m2 mrest<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>=number? m2 1<span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>rec m1 mrest<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span><span style="color: #a020f0;">and</span> <span style="color: #80a880;">(</span>number? m1<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>number? m2<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>rec <span style="color: #80a880;">(</span>* m1 m2<span style="color: #80a880;">)</span> mrest<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #a020f0;">else</span>
                <span style="color: #858580;">(</span><span style="color: #a020f0;">let</span> <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>val <span style="color: #707183;">(</span>rec m2 mrest<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                 <span style="color: #80a880;">(</span><span style="color: #a020f0;">if</span> <span style="color: #887070;">(</span>=number? <span style="color: #707183;">(</span>car val<span style="color: #707183;">)</span> 0<span style="color: #887070;">)</span>
                   <span style="color: #887070;">(</span>list 0<span style="color: #887070;">)</span>
                   <span style="color: #887070;">(</span>cons m1 val<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>val <span style="color: #907373;">(</span>rec m ms<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span><span style="color: #a020f0;">and</span> <span style="color: #907373;">(</span>pair? val<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>pair? <span style="color: #6276ba;">(</span>cdr val<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>cons '* val<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>car val<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">addend</span> s<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr s<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">augend</span> s<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>null? <span style="color: #709870;">(</span>cdddr s<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>caddr s<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>cons '+ <span style="color: #709870;">(</span>cddr s<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">multiplier</span> p<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr p<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">multiplicand</span> s<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>null? <span style="color: #709870;">(</span>cdddr s<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>caddr s<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>cons '* <span style="color: #709870;">(</span>cddr s<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock8"><span style="color: #707183;">(</span>test 0
      <span style="color: #7388d6;">(</span>make-sum 0 0 0 0 0 0<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 'x
      <span style="color: #7388d6;">(</span>make-sum <span style="color: #909183;">(</span>make-sum 'x<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test '<span style="color: #7388d6;">(</span>+ x 3<span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span>make-sum 'x 3<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test '<span style="color: #7388d6;">(</span>+ <span style="color: #909183;">(</span>+ x 3<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>+ y 2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span>make-sum <span style="color: #909183;">(</span>make-sum 'x 3<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>make-sum 'y 2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 0
      <span style="color: #7388d6;">(</span>make-product 'x 'y 'z 0<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 1
      <span style="color: #7388d6;">(</span>make-product 1 1 1 1 1 1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 'x
      <span style="color: #7388d6;">(</span>make-product <span style="color: #909183;">(</span>make-product 'x<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test '<span style="color: #7388d6;">(</span>* x 3<span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span>make-product 'x 3<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test '<span style="color: #7388d6;">(</span>* <span style="color: #909183;">(</span>* x 3<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>* y 2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span>make-product <span style="color: #909183;">(</span>make-product 'x 3<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>make-product 'y 2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
