ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%25_thm_2.58][Exercise 2.58.]]

***** a. Differentiation in infix form, fully parenthesized
Given that each non-atomic expression is a list consisting of a left and right
expression separated by either a ~+~ or ~*~ symbol, differentiation is mostly
a case of pattern matching:

#+NAME: ex-2-58-a
#+BEGIN_SRC scheme
  (define (sum? x)
    (and (pair? x) (pair? (cdr x)) (eq? (cadr x) '+)))
  (define (product? x)
    (and (pair? x) (pair? (cdr x)) (eq? (cadr x) '*)))
  (define (addend s) (car s))
  (define (augend s) (caddr s))
  (define (multiplier p) (car p))
  (define (multiplicand p) (caddr p))

  (define (make-sum a1 a2)
    (cond ((=number? a1 0)
           a2)
          ((=number? a2 0)
           a1)
          ((and (number? a1) (number? a2))
           (+ a1 a2))
          (else
            (list a1 '+ a2))))
  (define (make-product m1 m2)
    (cond ((or (=number? m1 0) (=number? m2 0))
           0)
          ((=number? m1 1)
           m2)
          ((=number? m2 1)
           m1)
          ((and (number? m1) (number? m2))
           (* m1 m2))
          (else
            (list m1 '* m2))))
#+END_SRC

#+NAME: ex-2-58-a-test
#+BEGIN_SRC scheme
  (define expr (make-sum 'x (make-product 3 (make-sum 'x (make-sum 'y 2)))))
  (test 4
        (deriv expr 'x))
  (test 3
        (deriv expr 'y))
  (test 0
        (deriv expr 'z))
#+END_SRC

