ch2/ch2.html

<div id="outline-container-orgheadline72" class="outline-5">
<h5 id="orgheadline72"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%_thm_2.58">Exercise 2.58.</a></h5>
<div class="outline-text-5" id="text-orgheadline72">
</div><ul class="org-ul"><li><a id="orgheadline70"></a>a. Differentiation in infix form, fully parenthesized<br  /><div class="outline-text-6" id="text-orgheadline70">
<p>
Given that each non-atomic expression is a list consisting of a left and right
expression separated by either a <code>+</code> or <code>*</code> symbol, differentiation is mostly
a case of pattern matching:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock9"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">sum?</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>pair? x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>pair? <span style="color: #709870;">(</span>cdr x<span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>eq? <span style="color: #709870;">(</span>cadr x<span style="color: #709870;">)</span> '+<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">product?</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>pair? x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>pair? <span style="color: #709870;">(</span>cdr x<span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>eq? <span style="color: #709870;">(</span>cadr x<span style="color: #709870;">)</span> '*<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">addend</span> s<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car s<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">augend</span> s<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>caddr s<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">multiplier</span> p<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car p<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">multiplicand</span> p<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>caddr p<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-sum</span> a1 a2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>=number? a1 0<span style="color: #709870;">)</span>
         a2<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>=number? a2 0<span style="color: #709870;">)</span>
         a1<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #a020f0;">and</span> <span style="color: #907373;">(</span>number? a1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>number? a2<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>+ a1 a2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span>
          <span style="color: #709870;">(</span>list a1 '+ a2<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-product</span> m1 m2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #a020f0;">or</span> <span style="color: #907373;">(</span>=number? m1 0<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>=number? m2 0<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         0<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>=number? m1 1<span style="color: #709870;">)</span>
         m2<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>=number? m2 1<span style="color: #709870;">)</span>
         m1<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span><span style="color: #a020f0;">and</span> <span style="color: #907373;">(</span>number? m1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>number? m2<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>* m1 m2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span>
          <span style="color: #709870;">(</span>list m1 '* m2<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock10"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">expr</span> <span style="color: #7388d6;">(</span>make-sum 'x <span style="color: #909183;">(</span>make-product 3 <span style="color: #709870;">(</span>make-sum 'x <span style="color: #907373;">(</span>make-sum 'y 2<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 4
      <span style="color: #7388d6;">(</span>deriv expr 'x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 3
      <span style="color: #7388d6;">(</span>deriv expr 'y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 0
      <span style="color: #7388d6;">(</span>deriv expr 'z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div></li>
