ch2/ch2.org
***** b. Differentiation of infix form with precedence

With precedence, a non-atomic expression may now be a list of more than three
elements --- a well-formed non-atomic expression now begins and ends with a
expression (where an operator is not an expression) and alternates between
operators and expressions.

Nevertheless, we can continue to use the ~deriv~ procedure defined above just
by changing the predicates and selectors (in addition to the changes in
ex-2-58-a). Precedence is determined as follows:

- Sum: list contains ~+~
- Product: list contains ~*~ but not ~+~
- Exponent (not implemented): list contains ~**~ but not ~*~ or ~+~

The sum and product selectors consider everything to the left of the first
corresponding symbol to form the left subexpression and everything to the
right to form the right subexpression. The sum and product selectors are only
valid for lists for which ~sum?~ and ~product?~, respectively, return
true. ~deriv~ makes sure to obey this prerequisite (it would be nice if Scheme
had an assertion facility which could be disabled for performance -- this
requires a macro to avoid evaluating the condition).

Since the right subexpression consists of everything after the first operator,
these infix operators are right associative. I believe the ~+~ and ~*~
operators are conventionally assumed to be left associative, although I'm not
sure. It's not a problem here because these operators are commutative, but if
needed, left associativity can be implemented by searching for the last
occurrence of a symbol rather than the first.

#+NAME: ex-2-58-b
#+BEGIN_SRC scheme
  (define (sum? x)
    (and (pair? x) (pair? (cdr x)) (memq '+ x)))
  (define (product? x)
    (and (pair? x) (pair? (cdr x)) (and (memq '* x)
                                        (not (memq '+ x)))))

  (define (addend s)
    (let ((res (take-while (lambda (x) (not (eq? x '+))) s)))
     (if (null? (cdr res)) (car res) res)))
  (define (augend s)
    (let ((res (cdr (drop-while (lambda (x) (not (eq? x '+))) s))))
     (if (null? (cdr res)) (car res) res)))
  (define (multiplier p)
    (let ((res (take-while (lambda (x) (not (eq? x '*))) p)))
     (if (null? (cdr res)) (car res) res)))
  (define (multiplicand p)
    (let ((res (cdr (drop-while (lambda (x) (not (eq? x '*))) p))))
     (if (null? (cdr res)) (car res) res)))
#+END_SRC

#+NAME: ex-2-58-b-test
#+BEGIN_SRC scheme
  (define expr '(x + 3 * (x + y + 2)))

  (test 4
        (deriv expr 'x))
  (test 3
        (deriv expr 'y))
  (test 0
        (deriv expr 'z))
#+END_SRC


*** 2.3.3: Example: Representing Sets


*** 2.3.4: Example: Huffman Encoding Trees


