ch2/ch2.html

<li><a id="orgheadline71"></a>b. Differentiation of infix form with precedence<br  /><div class="outline-text-6" id="text-orgheadline71">
<p>
With precedence, a non-atomic expression may now be a list of more than three
elements &#x2014; a well-formed non-atomic expression now begins and ends with a
expression (where an operator is not an expression) and alternates between
operators and expressions.
</p>

<p>
Nevertheless, we can continue to use the <code>deriv</code> procedure defined above just
by changing the predicates and selectors (in addition to the changes in
ex-2-58-a). Precedence is determined as follows:
</p>

<ul class="org-ul">
<li>Sum: list contains <code>+</code></li>
<li>Product: list contains <code>*</code> but not <code>+</code></li>
<li>Exponent (not implemented): list contains <code>**</code> but not <code>*</code> or <code>+</code></li>
</ul>

<p>
The sum and product selectors consider everything to the left of the first
corresponding symbol to form the left subexpression and everything to the
right to form the right subexpression. The sum and product selectors are only
valid for lists for which <code>sum?</code> and <code>product?</code>, respectively, return
true. <code>deriv</code> makes sure to obey this prerequisite (it would be nice if Scheme
had an assertion facility which could be disabled for performance &#x2013; this
requires a macro to avoid evaluating the condition).
</p>

<p>
Since the right subexpression consists of everything after the first operator,
these infix operators are right associative. I believe the <code>+</code> and <code>*</code>
operators are conventionally assumed to be left associative, although I'm not
sure. It's not a problem here because these operators are commutative, but if
needed, left associativity can be implemented by searching for the last
occurrence of a symbol rather than the first.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock11"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">sum?</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>pair? x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>pair? <span style="color: #709870;">(</span>cdr x<span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>memq '+ x<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">product?</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>pair? x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>pair? <span style="color: #709870;">(</span>cdr x<span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span><span style="color: #a020f0;">and</span> <span style="color: #709870;">(</span>memq '* x<span style="color: #709870;">)</span>
                                      <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>memq '+ x<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">addend</span> s<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>res <span style="color: #907373;">(</span>take-while <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">(</span>x<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>not <span style="color: #80a880;">(</span>eq? x '+<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> s<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>null? <span style="color: #907373;">(</span>cdr res<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>car res<span style="color: #709870;">)</span> res<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">augend</span> s<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>res <span style="color: #907373;">(</span>cdr <span style="color: #6276ba;">(</span>drop-while <span style="color: #858580;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #80a880;">(</span>x<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>not <span style="color: #887070;">(</span>eq? x '+<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span> s<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>null? <span style="color: #907373;">(</span>cdr res<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>car res<span style="color: #709870;">)</span> res<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">multiplier</span> p<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>res <span style="color: #907373;">(</span>take-while <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">(</span>x<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>not <span style="color: #80a880;">(</span>eq? x '*<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> p<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>null? <span style="color: #907373;">(</span>cdr res<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>car res<span style="color: #709870;">)</span> res<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">multiplicand</span> p<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>res <span style="color: #907373;">(</span>cdr <span style="color: #6276ba;">(</span>drop-while <span style="color: #858580;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #80a880;">(</span>x<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>not <span style="color: #887070;">(</span>eq? x '*<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span> p<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>null? <span style="color: #907373;">(</span>cdr res<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>car res<span style="color: #709870;">)</span> res<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock12"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">expr</span> '<span style="color: #7388d6;">(</span>x + 3 * <span style="color: #909183;">(</span>x + y + 2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>test 4
      <span style="color: #7388d6;">(</span>deriv expr 'x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 3
      <span style="color: #7388d6;">(</span>deriv expr 'y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 0
      <span style="color: #7388d6;">(</span>deriv expr 'z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div></li></ul>
</div>
</div>

<div id="outline-container-orgheadline73" class="outline-4">
<h4 id="orgheadline73"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%_sec_2.3.3">2.3.3: Example: Representing Sets</a></h4>
</div>
<div id="outline-container-orgheadline74" class="outline-4">
<h4 id="orgheadline74"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-16.html#%_sec_2.3.4">2.3.4: Example: Huffman Encoding Trees</a></h4>
</div>
</div>
