ch2/ch2.org
** 2.4: Multiple Representations for Abstract Data

#+BEGIN_SRC scheme :tangle dispatch-table.scm
  ;; Operation, type -> procedure dispatch table.
  (use apropos)
  (if (not (= (length (apropos-list '*op-table*)) 1))
      (begin
        (display "Defining *op-table*")
        (newline)
        (define *op-table* (make-hash-table equal?))
        (define (put op type proc)
          (hash-table-set! *op-table* (list op type) proc))
        (define (get op type)
          (hash-table-ref *op-table* (list op type)))

        ;; Without loss of generality
        <<ex-2-78-type-tag-scheme-number>>

        (define (apply-generic op . args)
          (let ((type-tags (map type-tag args)))
            (let ((proc (get op type-tags)))
              (if proc
                  (apply proc (map contents args))
                  (error
                   "No method for these types -- APPLY-GENERIC"
                   (list op type-tags))))))))
#+END_SRC

*** 2.4.1: Representations for Complex Numbers

No exercises.

*** 2.4.2: Tagged data

No exercises.

*** 2.4.3: Data-Directed Programming and Additivity

