ch2/ch2.html

<div id="outline-container-orgheadline76" class="outline-3">
<h3 id="orgheadline76"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_sec_2.4">2.4: Multiple Representations for Abstract Data</a></h3>
<div class="outline-text-3" id="text-orgheadline76">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Operation, type -&gt; procedure dispatch table.</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> apropos<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #7388d6;">(</span>not <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>length <span style="color: #907373;">(</span>apropos-list '*op-table*<span style="color: #907373;">)</span><span style="color: #709870;">)</span> 1<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
    <span style="color: #7388d6;">(</span><span style="color: #a020f0;">begin</span>
      <span style="color: #909183;">(</span>display <span style="color: #8b2252;">"Defining *op-table*"</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>newline<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">*op-table*</span> <span style="color: #709870;">(</span>make-hash-table equal?<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">put</span> op type proc<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>hash-table-set! *op-table* <span style="color: #907373;">(</span>list op type<span style="color: #907373;">)</span> proc<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">get</span> op type<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>hash-table-ref *op-table* <span style="color: #907373;">(</span>list op type<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>

      <span style="color: #b22222;">;; </span><span style="color: #b22222;">Without loss of generality</span>
      <span style="color: #228b22;">&lt;&lt;ex-2-78-type-tag-scheme-number&gt;&gt;</span>

      <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">apply-generic</span> op . args<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>type-tags <span style="color: #858580;">(</span><span style="color: #a020f0;">map</span> type-tag args<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>proc <span style="color: #80a880;">(</span>get op type-tags<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">if</span> proc
                <span style="color: #858580;">(</span>apply proc <span style="color: #80a880;">(</span><span style="color: #a020f0;">map</span> contents args<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                <span style="color: #858580;">(</span>error
                 <span style="color: #8b2252;">"No method for these types -- APPLY-GENERIC"</span>
                 <span style="color: #80a880;">(</span>list op type-tags<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>

<div id="outline-container-orgheadline77" class="outline-4">
<h4 id="orgheadline77"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_sec_2.4.1">2.4.1: Representations for Complex Numbers</a></h4>
<div class="outline-text-4" id="text-orgheadline77">
<p>
No exercises.
</p>
</div>
</div>

<div id="outline-container-orgheadline78" class="outline-4">
<h4 id="orgheadline78"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_sec_2.4.2">2.4.2: Tagged data</a></h4>
<div class="outline-text-4" id="text-orgheadline78">
<p>
No exercises.
</p>
</div>
</div>

<div id="outline-container-orgheadline83" class="outline-4">
<h4 id="orgheadline83"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_sec_2.4.3">2.4.3: Data-Directed Programming and Additivity</a></h4>
