ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.73][Exercise 2.73.]]

a. We dispatch to an implementation of differentiation based on the operator of
   an expression, which indicates whether it's a sum, product, etc. Since
   numbers and variables are not operators, we cannot dispatch into the table
   based on them and must handle them specially.

b. Code:

   #+BEGIN_SRC scheme
     (define (install-deriv-package)
       ;; internal procedures
       (define (make-sum a1 a2) (list '+ a1 a2))
       (define (addend s) (car s))
       (define (augend s) (cadr s))

       (define (make-product m1 m2) (list '* m1 m2))
       (define (multiplier p) (car p))
       (define (multiplicand p) (cadr p))

       (define (deriv-sum exp var)
         (make-sum (deriv (addend exp) var)
                   (deriv (augend exp) var)))

       (define (deriv-product exp var)
         (make-sum
           (make-product (multiplier exp)
                         (deriv (multiplicand  exp) var))
           (make-product (deriv (multiplier  exp) var)
                         (multiplicand exp))))

       ;; interface to the rest of the system
       (put 'deriv '+ deriv-sum)
       (put 'deriv '* deriv-product))
     (install-deriv-package)

   #+END_SRC

c. Here is an implementation for exponentiation:

   #+BEGIN_SRC scheme
     (define (make-exponentiation base power)
       (list '** base power))
     (define (base s) (car s))
     (define (exponent s) (cadr s))

     (define (deriv-exponentiation operands var)
       (make-product
         (make-product
           (exponent exp)
           (make-exponentiation
             (base exp)
             (- (exponent exp) 1)))
         (deriv (base exp) var)))
     (put 'deriv '** deriv-exponentiation)

   #+END_SRC

d. It is only necessary to change the places where the ~get~ or ~put~
   procedures are actually invoked. In my implementation above, since the only
   place these procedures are invoked besides in the definition of ~deriv~ is
   when registering the operator-specific commands, the order of the arguments
   to the ~put~ calls is the only thing to change.

**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.74][Exercise 2.74.]]

a. Assume that a procedure ~file-type~ can extract the type of a file without
   knowing the detailed structure of the file. For example, the first element
   of the file data structure always holds the type.

   The ~find-in-set~ procedure takes the set first and the key second.

   #+BEGIN_SRC scheme
     (define (get-record file employee-name)
       ((get (file-type file) 'find-in-set) file employee-name))
   #+END_SRC

b. Again, assume that the type of the record can be extracted without
   a detailed knowledge of the structure.

   Note that file and employee record types are in the same namespace so that
   the ~find-in-set~ procedure can easily be used for either.

   #+BEGIN_SRC scheme
     (define (get-salary record)
       ((get (record-type record) 'find-in-set) record 'salary))
   #+END_SRC

c. Note that this is abstracted away from the representation of the files and
   records -- everything is implemented in terms of the lower-level procedures
   given above.

   #+BEGIN_SRC scheme
     (define (find-employee-record files employee-name)
       (if (null? files)
         #f
         (let ((record (get-record (car files) employee-name)))
          (if record
            record
            (find-employee-record (cdr files) employee-name)))))
   #+END_SRC

d. Each file and employee record must be modified to place the type information
   in a place where ~file-type~ and ~record-type~ can extract it, and the
   primitive type-dependent procedures must be defined and put into the
   dispatch table.

