ch2/ch2.html
<div class="outline-text-4" id="text-orgheadline83">
</div><div id="outline-container-orgheadline79" class="outline-5">
<h5 id="orgheadline79"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.73">Exercise 2.73.</a></h5>
<div class="outline-text-5" id="text-orgheadline79">
<ol class="org-ol">
<li>We dispatch to an implementation of differentiation based on the operator of
an expression, which indicates whether it's a sum, product, etc. Since
numbers and variables are not operators, we cannot dispatch into the table
based on them and must handle them specially.</li>

<li><p>
Code:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">install-deriv-package</span><span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">internal procedures</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">make-sum</span> a1 a2<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>list '+ a1 a2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">addend</span> s<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>car s<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">augend</span> s<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>cadr s<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>

  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">make-product</span> m1 m2<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>list '* m1 m2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">multiplier</span> p<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>car p<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">multiplicand</span> p<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>cadr p<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>

  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">deriv-sum</span> exp var<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>make-sum <span style="color: #709870;">(</span>deriv <span style="color: #907373;">(</span>addend exp<span style="color: #907373;">)</span> var<span style="color: #709870;">)</span>
              <span style="color: #709870;">(</span>deriv <span style="color: #907373;">(</span>augend exp<span style="color: #907373;">)</span> var<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>

  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">deriv-product</span> exp var<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>make-sum
      <span style="color: #709870;">(</span>make-product <span style="color: #907373;">(</span>multiplier exp<span style="color: #907373;">)</span>
                    <span style="color: #907373;">(</span>deriv <span style="color: #6276ba;">(</span>multiplicand  exp<span style="color: #6276ba;">)</span> var<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>make-product <span style="color: #907373;">(</span>deriv <span style="color: #6276ba;">(</span>multiplier  exp<span style="color: #6276ba;">)</span> var<span style="color: #907373;">)</span>
                    <span style="color: #907373;">(</span>multiplicand exp<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>

  <span style="color: #b22222;">;; </span><span style="color: #b22222;">interface to the rest of the system</span>
  <span style="color: #7388d6;">(</span>put 'deriv '+ deriv-sum<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'deriv '* deriv-product<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>install-deriv-package<span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
Here is an implementation for exponentiation:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-exponentiation</span> base power<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>list '** base power<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">base</span> s<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car s<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">exponent</span> s<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr s<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">deriv-exponentiation</span> operands var<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>make-product
    <span style="color: #909183;">(</span>make-product
      <span style="color: #709870;">(</span>exponent exp<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>make-exponentiation
        <span style="color: #907373;">(</span>base exp<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>- <span style="color: #6276ba;">(</span>exponent exp<span style="color: #6276ba;">)</span> 1<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>deriv <span style="color: #709870;">(</span>base exp<span style="color: #709870;">)</span> var<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'deriv '** deriv-exponentiation<span style="color: #707183;">)</span>
</pre>
</div></li>

<li>It is only necessary to change the places where the <code>get</code> or <code>put</code>
procedures are actually invoked. In my implementation above, since the only
place these procedures are invoked besides in the definition of <code>deriv</code> is
when registering the operator-specific commands, the order of the arguments
to the <code>put</code> calls is the only thing to change.</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline80" class="outline-5">
<h5 id="orgheadline80"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.74">Exercise 2.74.</a></h5>
<div class="outline-text-5" id="text-orgheadline80">
<ol class="org-ol">
<li><p>
Assume that a procedure <code>file-type</code> can extract the type of a file without
knowing the detailed structure of the file. For example, the first element
of the file data structure always holds the type.
</p>

<p>
The <code>find-in-set</code> procedure takes the set first and the key second.
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">get-record</span> file employee-name<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>get <span style="color: #709870;">(</span>file-type file<span style="color: #709870;">)</span> 'find-in-set<span style="color: #909183;">)</span> file employee-name<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
Again, assume that the type of the record can be extracted without
a detailed knowledge of the structure.
</p>

<p>
Note that file and employee record types are in the same namespace so that
the <code>find-in-set</code> procedure can easily be used for either.
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">get-salary</span> record<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>get <span style="color: #709870;">(</span>record-type record<span style="color: #709870;">)</span> 'find-in-set<span style="color: #909183;">)</span> record 'salary<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
Note that this is abstracted away from the representation of the files and
records &#x2013; everything is implemented in terms of the lower-level procedures
given above.
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">find-employee-record</span> files employee-name<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>null? files<span style="color: #909183;">)</span>
    #f
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>record <span style="color: #6276ba;">(</span>get-record <span style="color: #858580;">(</span>car files<span style="color: #858580;">)</span> employee-name<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> record
       record
       <span style="color: #907373;">(</span>find-employee-record <span style="color: #6276ba;">(</span>cdr files<span style="color: #6276ba;">)</span> employee-name<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li>Each file and employee record must be modified to place the type information
in a place where <code>file-type</code> and <code>record-type</code> can extract it, and the
primitive type-dependent procedures must be defined and put into the
dispatch table.</li>
</ol>
</div>
</div>
