ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.75][Exercise 2.75.]]

#+BEGIN_SRC scheme
  (define (make-from-mag-ang mag ang)
    (define (dispatch op)
      (cond ((eq? op 'magnitude) mag)
            ((eq? op 'angle) ang)
            ((eq? op 'real-part)
             (* mag (cos ang)))
            ((eq? op 'imag-part)
             (* mag (sin ang)))
            (else
             (error "Unknown op -- MAKE-FROM-MAG-ANG" op))))
    dispatch)

  (define pi (* 2 (asin 1)))
  (define z (make-from-mag-ang 1 (/ pi 4)))
  (test 1
        (z 'magnitude))
  (test (/ pi 4)
        (z 'angle))
  (test (/ (sqrt 2) 2)
        (z 'real-part))
  (test (/ (sqrt 2) 2)
        (z 'imag-part))
#+END_SRC

**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.76][Exercise 2.76.]]

Steps to add types or operations:

- explicit dispatch :: Need to add an additional case in every operation when a
     new type is added, and need to explicitly dispatch on all types when a new
     operation is added.

- data-directed style :: can add new types easily by implementing all the
     operations in a package and then importing it.

- message-passing style :: can add new operations easily defined for a type, it
     can fall back to a default implementation or an error -- but adding new
     operations requires modifying every type.


** 2.5: Systems with Generic Operations

*** Auxiliary definitions

#+BEGIN_SRC scheme :tangle generic-arithmetic-procedures.scm
  (define (add x y) (apply-generic 'add x y))
  (define (sub x y) (apply-generic 'sub x y))
  (define (mul x y) (apply-generic 'mul x y))
  (define (div x y) (apply-generic 'div x y))
#+END_SRC

#+BEGIN_SRC scheme :tangle scheme-number-package.scm
  (define (install-scheme-number-package)
    (define (tag x)
      (attach-tag 'scheme-number x))
    (put 'add '(scheme-number scheme-number)
         (lambda (x y) (tag (+ x y))))
    (put 'sub '(scheme-number scheme-number)
         (lambda (x y) (tag (- x y))))
    (put 'mul '(scheme-number scheme-number)
         (lambda (x y) (tag (* x y))))
    (put 'div '(scheme-number scheme-number)
         (lambda (x y) (tag (/ x y))))
    (put 'make '(scheme-number)
         (lambda (x) (tag x)))
    'done)
  (install-scheme-number-package)
  (define (make-scheme-number n)
    ((get 'make '(scheme-number)) n))
#+END_SRC


*** 2.5.1: Generic Arithmetic Operations

