ch2/ch2.html

<div id="outline-container-orgheadline81" class="outline-5">
<h5 id="orgheadline81"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.75">Exercise 2.75.</a></h5>
<div class="outline-text-5" id="text-orgheadline81">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-from-mag-ang</span> mag ang<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">dispatch</span> op<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? op 'magnitude<span style="color: #907373;">)</span> mag<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? op 'angle<span style="color: #907373;">)</span> ang<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? op 'real-part<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>* mag <span style="color: #6276ba;">(</span>cos ang<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? op 'imag-part<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>* mag <span style="color: #6276ba;">(</span>sin ang<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span>
           <span style="color: #907373;">(</span>error <span style="color: #8b2252;">"Unknown op -- MAKE-FROM-MAG-ANG"</span> op<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  dispatch<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">pi</span> <span style="color: #7388d6;">(</span>* 2 <span style="color: #909183;">(</span>asin 1<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">z</span> <span style="color: #7388d6;">(</span>make-from-mag-ang 1 <span style="color: #909183;">(</span>/ pi 4<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 1
      <span style="color: #7388d6;">(</span>z 'magnitude<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test <span style="color: #7388d6;">(</span>/ pi 4<span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span>z 'angle<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test <span style="color: #7388d6;">(</span>/ <span style="color: #909183;">(</span>sqrt 2<span style="color: #909183;">)</span> 2<span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span>z 'real-part<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test <span style="color: #7388d6;">(</span>/ <span style="color: #909183;">(</span>sqrt 2<span style="color: #909183;">)</span> 2<span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span>z 'imag-part<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline82" class="outline-5">
<h5 id="orgheadline82"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.76">Exercise 2.76.</a></h5>
<div class="outline-text-5" id="text-orgheadline82">
<p>
Steps to add types or operations:
</p>

<dl class="org-dl">
<dt>explicit dispatch</dt><dd>Need to add an additional case in every operation when a
new type is added, and need to explicitly dispatch on all types when a new
operation is added.</dd>

<dt>data-directed style</dt><dd>can add new types easily by implementing all the
operations in a package and then importing it.</dd>

<dt>message-passing style</dt><dd>can add new operations easily defined for a type, it
can fall back to a default implementation or an error &#x2013; but adding new
operations requires modifying every type.</dd>
</dl>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline109" class="outline-3">
<h3 id="orgheadline109"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-18.html#%_sec_2.5">2.5: Systems with Generic Operations</a></h3>
<div class="outline-text-3" id="text-orgheadline109">
</div><div id="outline-container-orgheadline84" class="outline-4">
<h4 id="orgheadline84">Auxiliary definitions</h4>
<div class="outline-text-4" id="text-orgheadline84">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">add</span> x y<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>apply-generic 'add x y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">sub</span> x y<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>apply-generic 'sub x y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">mul</span> x y<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>apply-generic 'mul x y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">div</span> x y<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>apply-generic 'div x y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">install-scheme-number-package</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">tag</span> x<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>attach-tag 'scheme-number x<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'add '<span style="color: #909183;">(</span>scheme-number scheme-number<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x y<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>+ x y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'sub '<span style="color: #909183;">(</span>scheme-number scheme-number<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x y<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>- x y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'mul '<span style="color: #909183;">(</span>scheme-number scheme-number<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x y<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>* x y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'div '<span style="color: #909183;">(</span>scheme-number scheme-number<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x y<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>/ x y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'make '<span style="color: #909183;">(</span>scheme-number<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>tag x<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  'done<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>install-scheme-number-package<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-scheme-number</span> n<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>get 'make '<span style="color: #709870;">(</span>scheme-number<span style="color: #709870;">)</span><span style="color: #909183;">)</span> n<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline89" class="outline-4">
<h4 id="orgheadline89"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-18.html#%_sec_2.5.1">2.5.1: Generic Arithmetic Operations</a></h4>
