ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.77][Exercise 2.77.]]

#+BEGIN_SRC scheme
  (put 'real-part '(complex) real-part)
  (put 'imag-part '(complex) imag-part)
  (put 'magnitude '(complex) magnitude)
  (put 'angle '(complex) angle)
#+END_SRC

The ~real-part~, etc. functions are in fact simple wrappers around the
application of the corresponding generic operations:

#+BEGIN_SRC scheme
  (define (real-part z) (apply-generic 'real-part z))
  (define (imag-part z) (apply-generic 'imag-part z))
  (define (magnitude z) (apply-generic 'magnitude z))
  (define (angle z) (apply-generic 'angle z))
#+END_SRC

The ~rectangular~ and ~polar~ packages define internal procedures to implement
these generic operations. The generic operations defined for ~complex~ numbers
just end up dispatching to the corresponding generic ~rectangular~ or ~polar~
operations, only after which is the underlying internal function called.

For example, calling ~(magnitude z)~, where ~z~ is a ~complex~ number, results
in the following calls:

#+BEGIN_SRC scheme
  ;; Original application to complex type.
  (magnitude z)
  ;; Expansion from generic definition of magnitude.
  (apply-generic 'magnitude z)
  ;; Definition in this problem applies magnitude to contents of z (which may be
  ;; rectangular or polar).
  (magnitude (contents z))
  ;; Again, expansion from generic definition of magnitude.
  (apply-generic 'magnitude (contents z))
  ;; Application of generic magnitude operation to numbers tagged rectangular or
  ;; polar results in calling the implementation of magnitude internal to the
  ;; package.
  (internal-magnitude (contents (contents z)))
#+END_SRC

**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.78][Exercise 2.78.]]

We special-case numbers to return ~scheme-number~ as their type tag and avoid
adding the type tag to numbers that would otherwise be tagged with
~scheme-number~.

#+NAME: ex-2-78-type-tag-scheme-number
#+BEGIN_SRC scheme
  (include "generic-arithmetic-procedures.scm")
  (include "scheme-number-package.scm")
  (define (attach-tag type-tag contents)
    (if (and (equal? type-tag 'scheme-number)
             ;; Leave open the possibility to apply SCHEME-NUMBER to non-numbers.
             (number? contents))
        contents
        (cons type-tag contents)))
  (define (type-tag datum)
    (cond ((number? datum) 'scheme-number)
          ((pair? datum) (car datum))
          (else error "Bad tagged datum -- TYPE-TAG" datum)))
  (define (contents datum)
    (cond ((number? datum) datum)
          ((pair? datum) (cdr datum))
          (else (error "Bad tagged datum -- CONTENTS" datum))))
#+END_SRC

