ch2/ch2.html
<div class="outline-text-4" id="text-orgheadline89">
</div><div id="outline-container-orgheadline85" class="outline-5">
<h5 id="orgheadline85"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.77">Exercise 2.77.</a></h5>
<div class="outline-text-5" id="text-orgheadline85">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>put 'real-part '<span style="color: #7388d6;">(</span>complex<span style="color: #7388d6;">)</span> real-part<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'imag-part '<span style="color: #7388d6;">(</span>complex<span style="color: #7388d6;">)</span> imag-part<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'magnitude '<span style="color: #7388d6;">(</span>complex<span style="color: #7388d6;">)</span> magnitude<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'angle '<span style="color: #7388d6;">(</span>complex<span style="color: #7388d6;">)</span> angle<span style="color: #707183;">)</span>
</pre>
</div>

<p>
The <code>real-part</code>, etc. functions are in fact simple wrappers around the
application of the corresponding generic operations:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">real-part</span> z<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>apply-generic 'real-part z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">imag-part</span> z<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>apply-generic 'imag-part z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">magnitude</span> z<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>apply-generic 'magnitude z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">angle</span> z<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>apply-generic 'angle z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
The <code>rectangular</code> and <code>polar</code> packages define internal procedures to implement
these generic operations. The generic operations defined for <code>complex</code> numbers
just end up dispatching to the corresponding generic <code>rectangular</code> or <code>polar</code>
operations, only after which is the underlying internal function called.
</p>

<p>
For example, calling <code>(magnitude z)</code>, where <code>z</code> is a <code>complex</code> number, results
in the following calls:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Original application to complex type.</span>
<span style="color: #707183;">(</span>magnitude z<span style="color: #707183;">)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Expansion from generic definition of magnitude.</span>
<span style="color: #707183;">(</span>apply-generic 'magnitude z<span style="color: #707183;">)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Definition in this problem applies magnitude to contents of z (which may be</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">rectangular or polar).</span>
<span style="color: #707183;">(</span>magnitude <span style="color: #7388d6;">(</span>contents z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Again, expansion from generic definition of magnitude.</span>
<span style="color: #707183;">(</span>apply-generic 'magnitude <span style="color: #7388d6;">(</span>contents z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Application of generic magnitude operation to numbers tagged rectangular or</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">polar results in calling the implementation of magnitude internal to the</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">package.</span>
<span style="color: #707183;">(</span>internal-magnitude <span style="color: #7388d6;">(</span>contents <span style="color: #909183;">(</span>contents z<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline86" class="outline-5">
<h5 id="orgheadline86"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.78">Exercise 2.78.</a></h5>
<div class="outline-text-5" id="text-orgheadline86">
<p>
We special-case numbers to return <code>scheme-number</code> as their type tag and avoid
adding the type tag to numbers that would otherwise be tagged with
<code>scheme-number</code>.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock13"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"generic-arithmetic-procedures.scm"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"scheme-number-package.scm"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">attach-tag</span> type-tag contents<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span><span style="color: #a020f0;">and</span> <span style="color: #709870;">(</span>equal? type-tag 'scheme-number<span style="color: #709870;">)</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">Leave open the possibility to apply SCHEME-NUMBER to non-numbers.</span>
           <span style="color: #709870;">(</span>number? contents<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      contents
      <span style="color: #909183;">(</span>cons type-tag contents<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">type-tag</span> datum<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>number? datum<span style="color: #709870;">)</span> 'scheme-number<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>pair? datum<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>car datum<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span> error <span style="color: #8b2252;">"Bad tagged datum -- TYPE-TAG"</span> datum<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">contents</span> datum<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>number? datum<span style="color: #709870;">)</span> datum<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>pair? datum<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>cdr datum<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span> <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"Bad tagged datum -- CONTENTS"</span> datum<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
