ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.79][Exercise 2.79.]]

We define the top-level generic function for convenience:

#+BEGIN_SRC scheme :tangle generic-equ.scm
  (include "dispatch-table.scm")
  <<ex-2-79-impl>>
  (define equ? (apply-generic 'equ? x y))
#+END_SRC

Install the following functions as implementations for ~equ?~ in the
corresponding packages:

#+NAME: ex-2-79-impl
#+BEGIN_SRC scheme
  (define (equ?-scheme-number x y)
    (= x y))
  (put 'equ? '(scheme-number scheme-number) equ?-scheme-number)

  (define (equ?-rat x y)
    (and (= (numer x) (numer y))
         (= (denom x) (denom y))))
  (put 'equ? '(rational rational) equ?-rat)

  (define (equ?-complex x y)
    (and (= (real-part x) (real-part y)
            (imag-part x) (imag-part y))))
  (put 'equ? '(complex complex) equ?-complex)
#+END_SRC

**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.80][Exercise 2.80.]]

We define the top-level generic function for convenience:

#+BEGIN_SRC scheme :tangle generic-zero.scm
  (include "dispatch-table.scm")
  <<ex-2-80-impl>>
  (define =zero? (lambda (x)  (apply-generic '=zero? x)))
#+END_SRC

Install the following functions as implementations for ~=zero?~ in the
corresponding packages:

#+NAME: ex-2-80-impl
#+BEGIN_SRC scheme
  (define (=zero?-scheme-number x)
    (= x 0))
  (put '=zero? '(scheme-number) =zero?-scheme-number)

  (define (=zero?-complex x y)
    (= (magnitude x) 0))
  (put '=zero? '(complex) =zero?-complex)
#+END_SRC

One could also imagine defining ~=zero?~ as a generic function

#+BEGIN_SRC scheme
  (define (=zero? x)
    (equ? x (zero x)))
#+END_SRC

where ~zero~ is a function that returns a zero value of the type of
~x~. Assuming ~equ?~ properly equates zero values that have the same type but
different representations (e.g., for ~rat~ and ~polar~ numbers), the above
definition will work. However, this requires another operation to be defined
anyway, and makes it harder to override the ~=zero?~ operation per-type in the
event that such an override is desirable for efficiency or correctness.


*** 2.5.2: Combining Data of Different Types

**** Auxiliary definitions

#+BEGIN_SRC scheme :tangle coercion-table.scm
  (define *coercion-table* (make-hash-table equal?))

  (define (put-coercion type-from type-to proc)
    (hash-table-set!
     *coercion-table*
     (list type-from type-to)
     proc))

  (define (get-coercion type-from type-to)
    (hash-table-ref
     *coercion-table*
     (list type-from type-to)))
#+END_SRC

