ch2/ch2.html

<div id="outline-container-orgheadline87" class="outline-5">
<h5 id="orgheadline87"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.79">Exercise 2.79.</a></h5>
<div class="outline-text-5" id="text-orgheadline87">
<p>
We define the top-level generic function for convenience:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"dispatch-table.scm"</span><span style="color: #707183;">)</span>
<span style="color: #228b22;">&lt;&lt;ex-2-79-impl&gt;&gt;</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">equ?</span> <span style="color: #7388d6;">(</span>apply-generic 'equ? x y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Install the following functions as implementations for <code>equ?</code> in the
corresponding packages:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock14"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">equ?-scheme-number</span> x y<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>= x y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'equ? '<span style="color: #7388d6;">(</span>scheme-number scheme-number<span style="color: #7388d6;">)</span> equ?-scheme-number<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">equ?-rat</span> x y<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>numer x<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>numer y<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>denom x<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>denom y<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'equ? '<span style="color: #7388d6;">(</span>rational rational<span style="color: #7388d6;">)</span> equ?-rat<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">equ?-complex</span> x y<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>real-part x<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>real-part y<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span>imag-part x<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>imag-part y<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'equ? '<span style="color: #7388d6;">(</span>complex complex<span style="color: #7388d6;">)</span> equ?-complex<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline88" class="outline-5">
<h5 id="orgheadline88"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.80">Exercise 2.80.</a></h5>
<div class="outline-text-5" id="text-orgheadline88">
<p>
We define the top-level generic function for convenience:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"dispatch-table.scm"</span><span style="color: #707183;">)</span>
<span style="color: #228b22;">&lt;&lt;ex-2-80-impl&gt;&gt;</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">=zero?</span> <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x<span style="color: #909183;">)</span>  <span style="color: #909183;">(</span>apply-generic '=zero? x<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Install the following functions as implementations for <code>=zero?</code> in the
corresponding packages:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock15"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">=zero?-scheme-number</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>= x 0<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put '=zero? '<span style="color: #7388d6;">(</span>scheme-number<span style="color: #7388d6;">)</span> =zero?-scheme-number<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">=zero?-complex</span> x y<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>= <span style="color: #909183;">(</span>magnitude x<span style="color: #909183;">)</span> 0<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put '=zero? '<span style="color: #7388d6;">(</span>complex<span style="color: #7388d6;">)</span> =zero?-complex<span style="color: #707183;">)</span>
</pre>
</div>

<p>
One could also imagine defining <code>=zero?</code> as a generic function
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">=zero?</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>equ? x <span style="color: #909183;">(</span>zero x<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
where <code>zero</code> is a function that returns a zero value of the type of
<code>x</code>. Assuming <code>equ?</code> properly equates zero values that have the same type but
different representations (e.g., for <code>rat</code> and <code>polar</code> numbers), the above
definition will work. However, this requires another operation to be defined
anyway, and makes it harder to override the <code>=zero?</code> operation per-type in the
event that such an override is desirable for efficiency or correctness.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline95" class="outline-4">
<h4 id="orgheadline95"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-18.html#%_sec_2.5.2">2.5.2: Combining Data of Different Types</a></h4>
<div class="outline-text-4" id="text-orgheadline95">
</div><div id="outline-container-orgheadline90" class="outline-5">
<h5 id="orgheadline90">Auxiliary definitions</h5>
<div class="outline-text-5" id="text-orgheadline90">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">*coercion-table*</span> <span style="color: #7388d6;">(</span>make-hash-table equal?<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">put-coercion</span> type-from type-to proc<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>hash-table-set!
   *coercion-table*
   <span style="color: #909183;">(</span>list type-from type-to<span style="color: #909183;">)</span>
   proc<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">get-coercion</span> type-from type-to<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>hash-table-ref
   *coercion-table*
   <span style="color: #909183;">(</span>list type-from type-to<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
