ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.81][Exercise 2.81.]]

a. If ~exp~ is called with two ~complex~ numbers as arguments, ~apply-generic~
   will fail to find an implementation of ~exp~ for the arguments. However, it
   will then find a coercion ~complex->complex~ for ~t1->t2~ and then re-apply
   the ~exp~ operation with ~t1->t2~ applied to the first argument. Since this
   applies ~exp~ once again to two ~complex~ arguments, Louis' conversions
   will lead to an infinite loop.

b. Louis is not correct -- ~apply-generic~ works as is because it searches for
   an implementation of the generic operation for the argument types given
   before attempting coercion. If an implementation is found, coercion is
   never attempted, so there is no need to provide a coercion operation from a
   type to itself.

c. From the above, it is clear that the only time ~apply-generic~ would look
   for a conversion from a type to itself is when

   - The two arguments have the same type.
   - An implementation of the generic operation was not found.

   Therefore, the only thing to do is to raise an error for the lack of an
   implementation:

   #+BEGIN_SRC scheme
     (define (apply-generic op . args)
       (define (no-method op type-tags)
         (error "No method for these types"
                (list op type-tags)))
       (let ((type-tags (map type-tag args)))
         (let ((proc (get op type-tags)))
           (if proc
               (apply proc (map contents args))
               (if (= (length args) 2)
                   (let ((type1 (car type-tags))
                         (type2 (cadr type-tags))
                         (a1 (car args))
                         (a2 (cadr args)))
                     (if (equal? type1 type2)
                         (no-method op type-tags)
                         (let ((t1->t2 (get-coercion type1 type2))
                               (t2->t1 (get-coercion type2 type1)))
                           (cond (t1->t2
                                  (apply-generic op (t1->t2 a1) a2))
                                 (t2->t1
                                  (apply-generic op a1 (t2->t1 a2)))
                                 (else
                                  (no-method op type-tags))))))
                   (no-method op type-tags))))))
   #+END_SRC

