ch2/ch2.html

<div id="outline-container-orgheadline91" class="outline-5">
<h5 id="orgheadline91"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.81">Exercise 2.81.</a></h5>
<div class="outline-text-5" id="text-orgheadline91">
<ol class="org-ol">
<li>If <code>exp</code> is called with two <code>complex</code> numbers as arguments, <code>apply-generic</code>
will fail to find an implementation of <code>exp</code> for the arguments. However, it
will then find a coercion <code>complex-&gt;complex</code> for <code>t1-&gt;t2</code> and then re-apply
the <code>exp</code> operation with <code>t1-&gt;t2</code> applied to the first argument. Since this
applies <code>exp</code> once again to two <code>complex</code> arguments, Louis' conversions
will lead to an infinite loop.</li>

<li>Louis is not correct &#x2013; <code>apply-generic</code> works as is because it searches for
an implementation of the generic operation for the argument types given
before attempting coercion. If an implementation is found, coercion is
never attempted, so there is no need to provide a coercion operation from a
type to itself.</li>

<li><p>
From the above, it is clear that the only time <code>apply-generic</code> would look
for a conversion from a type to itself is when
</p>

<ul class="org-ul">
<li>The two arguments have the same type.</li>
<li>An implementation of the generic operation was not found.</li>
</ul>
<p>
Therefore, the only thing to do is to raise an error for the lack of an
implementation:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">apply-generic</span> op . args<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">no-method</span> op type-tags<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"No method for these types"</span>
           <span style="color: #709870;">(</span>list op type-tags<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>type-tags <span style="color: #907373;">(</span><span style="color: #a020f0;">map</span> type-tag args<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>proc <span style="color: #6276ba;">(</span>get op type-tags<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> proc
          <span style="color: #907373;">(</span>apply proc <span style="color: #6276ba;">(</span><span style="color: #a020f0;">map</span> contents args<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">if</span> <span style="color: #6276ba;">(</span>= <span style="color: #858580;">(</span>length args<span style="color: #858580;">)</span> 2<span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #a020f0;">let</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>type1 <span style="color: #887070;">(</span>car type-tags<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>type2 <span style="color: #887070;">(</span>cadr type-tags<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>a1 <span style="color: #887070;">(</span>car args<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>a2 <span style="color: #887070;">(</span>cadr args<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                <span style="color: #858580;">(</span><span style="color: #a020f0;">if</span> <span style="color: #80a880;">(</span>equal? type1 type2<span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>no-method op type-tags<span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span><span style="color: #a020f0;">let</span> <span style="color: #887070;">(</span><span style="color: #707183;">(</span>t1-&gt;t2 <span style="color: #7388d6;">(</span>get-coercion type1 type2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                          <span style="color: #707183;">(</span>t2-&gt;t1 <span style="color: #7388d6;">(</span>get-coercion type2 type1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                      <span style="color: #887070;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #707183;">(</span>t1-&gt;t2
                             <span style="color: #7388d6;">(</span>apply-generic op <span style="color: #909183;">(</span>t1-&gt;t2 a1<span style="color: #909183;">)</span> a2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                            <span style="color: #707183;">(</span>t2-&gt;t1
                             <span style="color: #7388d6;">(</span>apply-generic op a1 <span style="color: #909183;">(</span>t2-&gt;t1 a2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                            <span style="color: #707183;">(</span><span style="color: #a020f0;">else</span>
                             <span style="color: #7388d6;">(</span>no-method op type-tags<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span>no-method op type-tags<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>
</ol>
</div>
</div>
