ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.82][Exercise 2.82.]]

Here's the steps:

- First, test if the args are the proper types already for the operation. If
  so, apply the op and return the result.
- Else, we'll want to keep the list of arguments, as well as keep an index to
  the current argument, whose type we want to coerce all the other arguments
  to.
#+BEGIN_SRC scheme
  (define (apply-generic op . args)
    (define (no-method op type-tags)
      (error "No method for these types"
             (list op type-tags)))
    (define (attempt-coercion tried to-try)
      (if (null? to-try)
          (no-method op (map type-tag tried))
          (letrec ((current-arg (car to-try))
                   (current-type (type-tag current-arg))
                   (coerce-to-current
                    (lambda (x)
                      ((get-coercion (type-tag x) current-type) x)))
                   (coerced-args
                    (append (map coerce-to-current tried)
                            (list current-arg)
                            (map coerce-to-current (cdr to-try)))))
            (if (/= (length coerced-args)
                   (length (append tried to-try)))
                (attempt-coercion (append tried (list (car to-try)))
                                  (cdr to-try))
                (apply apply-generic op coerced-args)))))
    (let ((type-tags (map type-tag args)))
      (let ((proc (get op type-tags)))
        (if proc
            (apply proc (map contents args))
            (attempt-coercion '() args)))))
#+END_SRC

This procedure works for some simple cases. However, if

- the arguments to ~apply-generic~ are not of the appropriate type for ~op~,
- one argument ~t1~ cannot be coerced to the type of another argument ~t2~,
- a coercion for ~t1~ exists such that the argument list is valid for ~op~,

an appropriate coercion will not be found even though it exists.

**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.83][Exercise 2.83.]]

#+BEGIN_SRC scheme
  ;; Install these in the corresponding packages to implement the generic RAISE
  ;; operation.
  (define (raise-integer->rational x)
    (make-rat x 1))
  (define (raise-rational->real x)
    (/ (numer x) (denom x)))
  (define (raise-real->complex x)
    (make-from-real-imag x 0))

  ;; Raise over any numeric type
  (define (raise x) (apply-generic 'raise x))
#+END_SRC

