ch2/ch2.html

<div id="outline-container-orgheadline92" class="outline-5">
<h5 id="orgheadline92"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.82">Exercise 2.82.</a></h5>
<div class="outline-text-5" id="text-orgheadline92">
<p>
Here's the steps:
</p>

<ul class="org-ul">
<li>First, test if the args are the proper types already for the operation. If
so, apply the op and return the result.</li>
<li>Else, we'll want to keep the list of arguments, as well as keep an index to
the current argument, whose type we want to coerce all the other arguments
to.</li>
</ul>
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">apply-generic</span> op . args<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">no-method</span> op type-tags<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"No method for these types"</span>
           <span style="color: #709870;">(</span>list op type-tags<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">attempt-coercion</span> tried to-try<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>null? to-try<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>no-method op <span style="color: #907373;">(</span><span style="color: #a020f0;">map</span> type-tag tried<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">letrec</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>current-arg <span style="color: #858580;">(</span>car to-try<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                 <span style="color: #6276ba;">(</span>current-type <span style="color: #858580;">(</span>type-tag current-arg<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                 <span style="color: #6276ba;">(</span>coerce-to-current
                  <span style="color: #858580;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #80a880;">(</span>x<span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>get-coercion <span style="color: #707183;">(</span>type-tag x<span style="color: #707183;">)</span> current-type<span style="color: #887070;">)</span> x<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                 <span style="color: #6276ba;">(</span>coerced-args
                  <span style="color: #858580;">(</span>append <span style="color: #80a880;">(</span><span style="color: #a020f0;">map</span> coerce-to-current tried<span style="color: #80a880;">)</span>
                          <span style="color: #80a880;">(</span>list current-arg<span style="color: #80a880;">)</span>
                          <span style="color: #80a880;">(</span><span style="color: #a020f0;">map</span> coerce-to-current <span style="color: #887070;">(</span>cdr to-try<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">if</span> <span style="color: #6276ba;">(</span>/= <span style="color: #858580;">(</span>length coerced-args<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>length <span style="color: #80a880;">(</span>append tried to-try<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span>attempt-coercion <span style="color: #858580;">(</span>append tried <span style="color: #80a880;">(</span>list <span style="color: #887070;">(</span>car to-try<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                                <span style="color: #858580;">(</span>cdr to-try<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span>apply apply-generic op coerced-args<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>type-tags <span style="color: #907373;">(</span><span style="color: #a020f0;">map</span> type-tag args<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>proc <span style="color: #6276ba;">(</span>get op type-tags<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> proc
          <span style="color: #907373;">(</span>apply proc <span style="color: #6276ba;">(</span><span style="color: #a020f0;">map</span> contents args<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>attempt-coercion '<span style="color: #6276ba;">()</span> args<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
This procedure works for some simple cases. However, if
</p>

<ul class="org-ul">
<li>the arguments to <code>apply-generic</code> are not of the appropriate type for <code>op</code>,</li>
<li>one argument <code>t1</code> cannot be coerced to the type of another argument <code>t2</code>,</li>
<li>a coercion for <code>t1</code> exists such that the argument list is valid for <code>op</code>,</li>
</ul>

<p>
an appropriate coercion will not be found even though it exists.
</p>
</div>
</div>

<div id="outline-container-orgheadline93" class="outline-5">
<h5 id="orgheadline93"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.83">Exercise 2.83.</a></h5>
<div class="outline-text-5" id="text-orgheadline93">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Install these in the corresponding packages to implement the generic RAISE</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">operation.</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">raise-integer-&gt;rational</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>make-rat x 1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">raise-rational-&gt;real</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>/ <span style="color: #909183;">(</span>numer x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>denom x<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">raise-real-&gt;complex</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>make-from-real-imag x 0<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Raise over any numeric type</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">raise</span> x<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>apply-generic 'raise x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
