ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.84][Exercise 2.84.]]

For simplicity, use the earlier two-argument version of ~apply-generic~.

One simple way to extend the earlier ~apply-generic~ procedure is to first
attempt coercing the arguments as before

#+BEGIN_SRC scheme
  (define (apply-generic op . args)
    (define (no-method op type-tags)
      (error "No method for these types"
             (list op type-tags)))
    (let ((type-tags (map type-tag args)))
      (let ((proc (get op type-tags)))
        (if proc
            (apply proc (map contents args))
            (if (= (length args) 2)
                (let ((type1 (car type-tags))
                      (type2 (cadr type-tags))
                      (a1 (car args))
                      (a2 (cadr args)))
                  (if (equal? type1 type2)
                      (no-method op type-tags)
                      (let ((t1->t2 (get-coercion type1 type2))
                            (t2->t1 (get-coercion type2 type1)))
                        (cond (t1->t2
                               (apply-generic op (t1->t2 a1) a2))
                              (t2->t1
                               (apply-generic op a1 (t2->t1 a2)))
                              (else
                               (no-method op type-tags))))))
                (no-method op type-tags))))))
#+END_SRC


*** 2.5.3: Example: Symbolic Algebra

I've decided to distinguish dense and sparse polynomials with the ~poly-dense~
and ~poly-sparse~ tags to allow keeping functions for both variants defined at
the same time. A similar distinction is made when defining auxiliary functions
for the two types before putting them in the dispatch table.

