ch2/ch2.html

<div id="outline-container-orgheadline94" class="outline-5">
<h5 id="orgheadline94"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.84">Exercise 2.84.</a></h5>
<div class="outline-text-5" id="text-orgheadline94">
<p>
For simplicity, use the earlier two-argument version of <code>apply-generic</code>.
</p>

<p>
One simple way to extend the earlier <code>apply-generic</code> procedure is to first
attempt coercing the arguments as before
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">apply-generic</span> op . args<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">no-method</span> op type-tags<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"No method for these types"</span>
           <span style="color: #709870;">(</span>list op type-tags<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>type-tags <span style="color: #907373;">(</span><span style="color: #a020f0;">map</span> type-tag args<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>proc <span style="color: #6276ba;">(</span>get op type-tags<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> proc
          <span style="color: #907373;">(</span>apply proc <span style="color: #6276ba;">(</span><span style="color: #a020f0;">map</span> contents args<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">if</span> <span style="color: #6276ba;">(</span>= <span style="color: #858580;">(</span>length args<span style="color: #858580;">)</span> 2<span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #a020f0;">let</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>type1 <span style="color: #887070;">(</span>car type-tags<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>type2 <span style="color: #887070;">(</span>cadr type-tags<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>a1 <span style="color: #887070;">(</span>car args<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>a2 <span style="color: #887070;">(</span>cadr args<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                <span style="color: #858580;">(</span><span style="color: #a020f0;">if</span> <span style="color: #80a880;">(</span>equal? type1 type2<span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>no-method op type-tags<span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span><span style="color: #a020f0;">let</span> <span style="color: #887070;">(</span><span style="color: #707183;">(</span>t1-&gt;t2 <span style="color: #7388d6;">(</span>get-coercion type1 type2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                          <span style="color: #707183;">(</span>t2-&gt;t1 <span style="color: #7388d6;">(</span>get-coercion type2 type1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                      <span style="color: #887070;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #707183;">(</span>t1-&gt;t2
                             <span style="color: #7388d6;">(</span>apply-generic op <span style="color: #909183;">(</span>t1-&gt;t2 a1<span style="color: #909183;">)</span> a2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                            <span style="color: #707183;">(</span>t2-&gt;t1
                             <span style="color: #7388d6;">(</span>apply-generic op a1 <span style="color: #909183;">(</span>t2-&gt;t1 a2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                            <span style="color: #707183;">(</span><span style="color: #a020f0;">else</span>
                             <span style="color: #7388d6;">(</span>no-method op type-tags<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span>no-method op type-tags<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline96" class="outline-4">
<h4 id="orgheadline96"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-18.html#%_sec_2.5.3">2.5.3: Example: Symbolic Algebra</a></h4>
<div class="outline-text-4" id="text-orgheadline96">
<p>
I've decided to distinguish dense and sparse polynomials with the <code>poly-dense</code>
and <code>poly-sparse</code> tags to allow keeping functions for both variants defined at
the same time. A similar distinction is made when defining auxiliary functions
for the two types before putting them in the dispatch table.
</p>
</div>
