ch2/ch2.org
**** Auxiliary definitions

#+BEGIN_SRC scheme :tangle poly-sparse-package.scm
  ;; <procedures same-variable? and variable? from section 2.3.2>
  (include "dispatch-table.scm")
  (include "generic-zero.scm")
  (include "generic-neg.scm")
  (include "generic-reduce.scm")
  (define (variable? x) (symbol? x))
  (define (same-variable? v1 v2)
    (and (variable? v1) (variable? v2) (eq? v1 v2)))
  
  (define (install-poly-sparse-package)
    <<poly-sparse-basic-procs>>

    <<poly-sparse-arithmetic-terms>>

    <<poly-sparse-arithmetic-poly>>

    ;; interface to rest of the system
    (put 'make '(poly-sparse)
         (lambda (var terms) (tag (make-poly-sparse var terms))))
    'done)
  (install-poly-sparse-package)
  (define (make-poly-sparse var terms)
    ((get 'make '(poly-sparse)) var terms))
#+END_SRC

#+NAME: poly-sparse-basic-procs
#+BEGIN_SRC scheme
  ;; internal procedures
  ;; representation of poly
  (define (make-poly-sparse variable term-list)
    (cons variable term-list))
  (define (variable p) (car p))
  (define (term-list p) (cdr p))
  ;; <procedures same-variable? and variable? from section 2.3.2>
  (define (variable? x) (symbol? x))
  (define (same-variable? v1 v2)
    (and (variable? v1) (variable? v2) (eq? v1 v2)))
  ;; representation of terms and term lists
  ;; <procedures adjoin-term ...coeff from text below>
  (define (adjoin-term term term-list)
    (if (=zero? (coeff term))
        term-list
        (cons term term-list)))
  (define (the-empty-termlist) '())
  (define (first-term term-list) (car term-list))
  (define (rest-terms term-list) (cdr term-list))
  (define (empty-termlist? term-list) (null? term-list))
  (define (make-term order coeff) (list order coeff))
  (define (order term) (car term))
  (define (coeff term) (cadr term))

  (define (tag p) (attach-tag 'poly-sparse p))
#+END_SRC

#+NAME: poly-sparse-arithmetic-terms
#+BEGIN_SRC scheme
  <<poly-sparse-add-terms>>
  <<poly-sparse-sub-terms>>
  <<poly-sparse-mul-terms>>
  <<poly-sparse-div-terms>>
  <<ex-2-94-terms>>
  <<ex-2-96-improved-terms>>
  <<ex-2-96-reimproved-terms>>
  <<poly-sparse-reduce-terms>>
#+END_SRC

#+NAME: poly-sparse-add-terms
#+BEGIN_SRC scheme
  (define (add-terms L1 L2)
    (cond ((empty-termlist? L1) L2)
          ((empty-termlist? L2) L1)
          (else
           (let ((t1 (first-term L1)) (t2 (first-term L2)))
             (cond ((> (order t1) (order t2))
                    (adjoin-term
                     t1 (add-terms (rest-terms L1) L2)))
                   ((< (order t1) (order t2))
                    (adjoin-term
                     t2 (add-terms L1 (rest-terms L2))))
                   (else
                    (adjoin-term
                     (make-term (order t1)
                                (add (coeff t1) (coeff t2)))
                     (add-terms (rest-terms L1)
                                (rest-terms L2)))))))))
#+END_SRC

#+NAME: poly-sparse-mul-terms
#+BEGIN_SRC scheme
  (define (mul-terms L1 L2)
    (if (empty-termlist? L1)
        (the-empty-termlist)
        (add-terms (mul-term-by-all-terms (first-term L1) L2)
                   (mul-terms (rest-terms L1) L2))))
  (define (mul-term-by-all-terms t1 L)
    (if (empty-termlist? L)
        (the-empty-termlist)
        (let ((t2 (first-term L)))
          (adjoin-term
           (make-term (+ (order t1) (order t2))
                      (mul (coeff t1) (coeff t2)))
           (mul-term-by-all-terms t1 (rest-terms L))))))
#+END_SRC

#+NAME: poly-sparse-arithmetic-poly
#+BEGIN_SRC scheme
  ;; Arithmetic on polynomials in terms of arithmetic on their term lists.
  <<ex-2-87-zero>>
  (define (neg-poly-sparse p)
    (make-poly-sparse (variable p)
                      (neg-terms (term-list p))))
  (put 'neg '(poly-sparse)
       (lambda (x) (tag (neg-poly-sparse x))))
  (define (add-poly-sparse p1 p2)
    (if (same-variable? (variable p1) (variable p2))
        (make-poly-sparse (variable p1)
                          (add-terms (term-list p1) (term-list p2)))
        (error "ADD-POLY -- cannot add two polynomials with different variables")))
  (put 'add '(poly-sparse poly-sparse)
       (lambda (x y) (tag (add-poly-sparse x y))))
  (define (sub-poly-sparse p1 p2)
    (add-poly-sparse p1 (neg-poly-sparse p2)))
  (put 'sub '(poly-sparse poly-sparse)
       (lambda (x y) (tag (sub-poly-sparse x y))))
  (define (mul-poly-sparse p1 p2)
    (if (same-variable? (variable p1) (variable p2))
        (make-poly-sparse (variable p1)
                          (mul-terms (term-list p1) (term-list p2)))
        (error "MUL-POLY -- cannot multiply two polynomials with different variables")))
  (put 'mul '(poly-sparse poly-sparse)
       (lambda (x y) (tag (mul-poly-sparse x y))))
  <<ex-2-91-div-poly-sparse>>
  <<ex-2-94-gcd-poly-sparse>>
  <<ex-2-96-improved-gcd-poly-sparse>>
  <<ex-2-96-reimproved-gcd-poly-sparse>>
  <<poly-sparse-reduce>>
#+END_SRC

