ch2/ch2.html

<div id="outline-container-orgheadline97" class="outline-5">
<h5 id="orgheadline97">Auxiliary definitions</h5>
<div class="outline-text-5" id="text-orgheadline97">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #b22222;">;; </span><span style="color: #b22222;">&lt;procedures same-variable? and variable? from section 2.3.2&gt;</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"dispatch-table.scm"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"generic-zero.scm"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"generic-neg.scm"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"generic-reduce.scm"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">variable?</span> x<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>symbol? x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">same-variable?</span> v1 v2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>variable? v1<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>variable? v2<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>eq? v1 v2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">install-poly-sparse-package</span><span style="color: #7388d6;">)</span>
  <span style="color: #228b22;">&lt;&lt;poly-sparse-basic-procs&gt;&gt;</span>

  <span style="color: #228b22;">&lt;&lt;poly-sparse-arithmetic-terms&gt;&gt;</span>

  <span style="color: #228b22;">&lt;&lt;poly-sparse-arithmetic-poly&gt;&gt;</span>

  <span style="color: #b22222;">;; </span><span style="color: #b22222;">interface to rest of the system</span>
  <span style="color: #7388d6;">(</span>put 'make '<span style="color: #909183;">(</span>poly-sparse<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>var terms<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>make-poly-sparse var terms<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  'done<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>install-poly-sparse-package<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-poly-sparse</span> var terms<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>get 'make '<span style="color: #709870;">(</span>poly-sparse<span style="color: #709870;">)</span><span style="color: #909183;">)</span> var terms<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock16"><span style="color: #b22222;">;; </span><span style="color: #b22222;">internal procedures</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">representation of poly</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-poly-sparse</span> variable term-list<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>cons variable term-list<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">variable</span> p<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car p<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">term-list</span> p<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr p<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&lt;procedures same-variable? and variable? from section 2.3.2&gt;</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">variable?</span> x<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>symbol? x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">same-variable?</span> v1 v2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>variable? v1<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>variable? v2<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>eq? v1 v2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">representation of terms and term lists</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&lt;procedures adjoin-term ...coeff from text below&gt;</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">adjoin-term</span> term term-list<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>=zero? <span style="color: #709870;">(</span>coeff term<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      term-list
      <span style="color: #909183;">(</span>cons term term-list<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">the-empty-termlist</span><span style="color: #7388d6;">)</span> '<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">first-term</span> term-list<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car term-list<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">rest-terms</span> term-list<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr term-list<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">empty-termlist?</span> term-list<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>null? term-list<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-term</span> order coeff<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>list order coeff<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">order</span> term<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car term<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">coeff</span> term<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr term<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">tag</span> p<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>attach-tag 'poly-sparse p<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock17"><span style="color: #228b22;">&lt;&lt;poly-sparse-add-terms&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;poly-sparse-sub-terms&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;poly-sparse-mul-terms&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;poly-sparse-div-terms&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-2-94-terms&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-2-96-improved-terms&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-2-96-reimproved-terms&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;poly-sparse-reduce-terms&gt;&gt;</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock18"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">add-terms</span> L1 L2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>empty-termlist? L1<span style="color: #709870;">)</span> L2<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>empty-termlist? L2<span style="color: #709870;">)</span> L1<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span>
         <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>t1 <span style="color: #858580;">(</span>first-term L1<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>t2 <span style="color: #858580;">(</span>first-term L2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>&gt; <span style="color: #80a880;">(</span>order t1<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>order t2<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span>adjoin-term
                   t1 <span style="color: #80a880;">(</span>add-terms <span style="color: #887070;">(</span>rest-terms L1<span style="color: #887070;">)</span> L2<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                 <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>&lt; <span style="color: #80a880;">(</span>order t1<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>order t2<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span>adjoin-term
                   t2 <span style="color: #80a880;">(</span>add-terms L1 <span style="color: #887070;">(</span>rest-terms L2<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                 <span style="color: #6276ba;">(</span><span style="color: #a020f0;">else</span>
                  <span style="color: #858580;">(</span>adjoin-term
                   <span style="color: #80a880;">(</span>make-term <span style="color: #887070;">(</span>order t1<span style="color: #887070;">)</span>
                              <span style="color: #887070;">(</span>add <span style="color: #707183;">(</span>coeff t1<span style="color: #707183;">)</span> <span style="color: #707183;">(</span>coeff t2<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                   <span style="color: #80a880;">(</span>add-terms <span style="color: #887070;">(</span>rest-terms L1<span style="color: #887070;">)</span>
                              <span style="color: #887070;">(</span>rest-terms L2<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock19"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">mul-terms</span> L1 L2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>empty-termlist? L1<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>the-empty-termlist<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>add-terms <span style="color: #709870;">(</span>mul-term-by-all-terms <span style="color: #907373;">(</span>first-term L1<span style="color: #907373;">)</span> L2<span style="color: #709870;">)</span>
                 <span style="color: #709870;">(</span>mul-terms <span style="color: #907373;">(</span>rest-terms L1<span style="color: #907373;">)</span> L2<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">mul-term-by-all-terms</span> t1 L<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>empty-termlist? L<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>the-empty-termlist<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>t2 <span style="color: #6276ba;">(</span>first-term L<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>adjoin-term
         <span style="color: #907373;">(</span>make-term <span style="color: #6276ba;">(</span>+ <span style="color: #858580;">(</span>order t1<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>order t2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                    <span style="color: #6276ba;">(</span>mul <span style="color: #858580;">(</span>coeff t1<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>coeff t2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
         <span style="color: #907373;">(</span>mul-term-by-all-terms t1 <span style="color: #6276ba;">(</span>rest-terms L<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock20"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Arithmetic on polynomials in terms of arithmetic on their term lists.</span>
<span style="color: #228b22;">&lt;&lt;ex-2-87-zero&gt;&gt;</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">neg-poly-sparse</span> p<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>make-poly-sparse <span style="color: #909183;">(</span>variable p<span style="color: #909183;">)</span>
                    <span style="color: #909183;">(</span>neg-terms <span style="color: #709870;">(</span>term-list p<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'neg '<span style="color: #7388d6;">(</span>poly-sparse<span style="color: #7388d6;">)</span>
     <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>tag <span style="color: #709870;">(</span>neg-poly-sparse x<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">add-poly-sparse</span> p1 p2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>same-variable? <span style="color: #709870;">(</span>variable p1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>variable p2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>make-poly-sparse <span style="color: #709870;">(</span>variable p1<span style="color: #709870;">)</span>
                        <span style="color: #709870;">(</span>add-terms <span style="color: #907373;">(</span>term-list p1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>term-list p2<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"ADD-POLY -- cannot add two polynomials with different variables"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'add '<span style="color: #7388d6;">(</span>poly-sparse poly-sparse<span style="color: #7388d6;">)</span>
     <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x y<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>tag <span style="color: #709870;">(</span>add-poly-sparse x y<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">sub-poly-sparse</span> p1 p2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>add-poly-sparse p1 <span style="color: #909183;">(</span>neg-poly-sparse p2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'sub '<span style="color: #7388d6;">(</span>poly-sparse poly-sparse<span style="color: #7388d6;">)</span>
     <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x y<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>tag <span style="color: #709870;">(</span>sub-poly-sparse x y<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">mul-poly-sparse</span> p1 p2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>same-variable? <span style="color: #709870;">(</span>variable p1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>variable p2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>make-poly-sparse <span style="color: #709870;">(</span>variable p1<span style="color: #709870;">)</span>
                        <span style="color: #709870;">(</span>mul-terms <span style="color: #907373;">(</span>term-list p1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>term-list p2<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"MUL-POLY -- cannot multiply two polynomials with different variables"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'mul '<span style="color: #7388d6;">(</span>poly-sparse poly-sparse<span style="color: #7388d6;">)</span>
     <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x y<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>tag <span style="color: #709870;">(</span>mul-poly-sparse x y<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #228b22;">&lt;&lt;ex-2-91-div-poly-sparse&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-2-94-gcd-poly-sparse&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-2-96-improved-gcd-poly-sparse&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-2-96-reimproved-gcd-poly-sparse&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;poly-sparse-reduce&gt;&gt;</span>
</pre>
</div>
</div>
</div>
