ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.87][Exercise 2.87.]]

Install ~=zero?~ for polynomials in the generic arithmetic package. This will
allow ~adjoin-term~ to work for polynomials with coefficients that are
themselves polynomials.

#+NAME: ex-2-87-zero
#+BEGIN_SRC scheme
  (include "generic-zero.scm")
  (define (=zero?-poly-sparse p)
    (let =zero?-terms ((terms (term-list p)))
      (or (empty-termlist? terms)
          (and (=zero? (coeff (first-term terms)))
               (=zero?-terms (rest-terms terms))))))
  (put '=zero? 'poly-sparse =zero?-poly-sparse)
#+END_SRC

**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.88][Exercise 2.88.]]

We define subtraction in terms of negation. For this, it is useful to have a
generic negation function ~neg~:

#+BEGIN_SRC scheme :tangle generic-neg.scm
  (include "dispatch-table.scm")
  <<ex-2-88-neg-monomial>>
  (define (neg x) (apply-generic 'neg x))
#+END_SRC

#+NAME: ex-2-88-neg-monomial
#+BEGIN_SRC scheme
  (define (neg-complex z)
    (make-from-real-imag (- (real-part z))
                         (- (imag-part z))))
  (put 'neg '(complex) neg-complex)
  (put 'neg '(scheme-number)
       (lambda (x) (attach-tag 'scheme-number (- x))))
#+END_SRC

#+NAME: poly-sparse-sub-terms
#+BEGIN_SRC scheme
  (include "generic-neg.scm")
  (define (neg-terms terms)
    (if (empty-termlist? terms)
        (the-empty-termlist)
        (adjoin-term (make-term (order (first-term terms))
                                (neg (coeff (first-term terms))))
                     (neg-terms (rest-terms terms)))))
  (define (sub-terms L1 L2)
    (add-terms L1 (neg-terms L2)))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-2-89-test.scm
  <<poly-sparse-basic-procs>>
  <<poly-sparse-sub-terms>>
  (test '((5 -3) (3 1))
        (neg-terms '((5 3) (3 -1))))
#+END_SRC

