ch2/ch2.html

<div id="outline-container-orgheadline98" class="outline-5">
<h5 id="orgheadline98"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.87">Exercise 2.87.</a></h5>
<div class="outline-text-5" id="text-orgheadline98">
<p>
Install <code>=zero?</code> for polynomials in the generic arithmetic package. This will
allow <code>adjoin-term</code> to work for polynomials with coefficients that are
themselves polynomials.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock21"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"generic-zero.scm"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">=zero?-poly-sparse</span> p<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">=zero?-terms</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>terms <span style="color: #907373;">(</span>term-list p<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">or</span> <span style="color: #709870;">(</span>empty-termlist? terms<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">and</span> <span style="color: #907373;">(</span>=zero? <span style="color: #6276ba;">(</span>coeff <span style="color: #858580;">(</span>first-term terms<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
             <span style="color: #907373;">(</span>=zero?-terms <span style="color: #6276ba;">(</span>rest-terms terms<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put '=zero? 'poly-sparse =zero?-poly-sparse<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline99" class="outline-5">
<h5 id="orgheadline99"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.88">Exercise 2.88.</a></h5>
<div class="outline-text-5" id="text-orgheadline99">
<p>
We define subtraction in terms of negation. For this, it is useful to have a
generic negation function <code>neg</code>:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"dispatch-table.scm"</span><span style="color: #707183;">)</span>
<span style="color: #228b22;">&lt;&lt;ex-2-88-neg-monomial&gt;&gt;</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">neg</span> x<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>apply-generic 'neg x<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock22"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">neg-complex</span> z<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>make-from-real-imag <span style="color: #909183;">(</span>- <span style="color: #709870;">(</span>real-part z<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                       <span style="color: #909183;">(</span>- <span style="color: #709870;">(</span>imag-part z<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'neg '<span style="color: #7388d6;">(</span>complex<span style="color: #7388d6;">)</span> neg-complex<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'neg '<span style="color: #7388d6;">(</span>scheme-number<span style="color: #7388d6;">)</span>
     <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>attach-tag 'scheme-number <span style="color: #709870;">(</span>- x<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock23"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"generic-neg.scm"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">neg-terms</span> terms<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>empty-termlist? terms<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>the-empty-termlist<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>adjoin-term <span style="color: #709870;">(</span>make-term <span style="color: #907373;">(</span>order <span style="color: #6276ba;">(</span>first-term terms<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                              <span style="color: #907373;">(</span>neg <span style="color: #6276ba;">(</span>coeff <span style="color: #858580;">(</span>first-term terms<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                   <span style="color: #709870;">(</span>neg-terms <span style="color: #907373;">(</span>rest-terms terms<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">sub-terms</span> L1 L2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>add-terms L1 <span style="color: #909183;">(</span>neg-terms L2<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #228b22;">&lt;&lt;poly-sparse-basic-procs&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;poly-sparse-sub-terms&gt;&gt;</span>
<span style="color: #707183;">(</span>test '<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>5 -3<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>3 1<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span>neg-terms '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>5 3<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>3 -1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
