ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.89][Exercise 2.89.]]

#+BEGIN_SRC scheme :tangle poly-dense-package.scm
  (define (install-poly-dense-package)
    ;; internal procedures
    ;; representation of poly
    (define (make-poly variable term-list)
      (cons variable term-list))
    (define (variable p) (car p))
    (define (term-list p) (cdr p))
    ;; <procedures same-variable? and variable? from section 2.3.2>
    (define (variable? x) (symbol? x))
    (define (same-variable? v1 v2)
      (and (variable? v1) (variable? v2) (eq? v1 v2)))
    ;; representation of terms and term lists
    ;; <procedures adjoin-term ...coeff from text below>
    (define (adjoin-term term term-list)
      (if (=zero? term)
          term-list
          (cons term term-list)))
    (define (the-empty-termlist) '())
    (define (first-term term-list) (car term-list))
    (define (rest-terms term-list) (cdr term-list))
    (define (empty-termlist? term-list) (null? term-list))

    (define (add-poly p1 p2)
      (if (same-variable? (variable p1) (variable p2))
          (make-poly (variable p1)
                     (add-terms (term-list p1) (term-list p2))))
      (error "ADD-POLY -- cannot add two polynomials with different variables"))
    ;; <procedures used by add-poly>
    (define (add-terms L1 L2)
      (let (rec (L1 L1)
                (L2 L2)
                (o1 (length L1))
                (o2 (length L2)))
        (cond ((empty-termlist? L1) L2)
              ((empty-termlist? L2) L1)
              ((> o1 o2)
               (adjoin-term (first-term L1) (rec (rest-terms L1) L2 (- o1 1) o2)))
              ((> o2 o1)
               (adjoin-term (first-term L2) (rec L1 (rest-terms L2) o1 (- o2 1))))
              (else
               (adjoin-term (add (first-term L1)
                                 (first-term L2))
                            (rec (rest-terms L1) (rest-terms L2)
                                 (- o1 1) (- o2 1)))))))
    (define (mul-poly p1 p2)
      (if (same-variable? (variable p1) (variable p2))
          (make-poly (variable p1)
                     (mul-terms (term-list p1) (term-list p2))))
      (error "MUL-POLY -- cannot multiply two polynomials with different variables"))
    ;; <procedures used by mul-poly>
    (define (mul-terms L1 L2)
      (let (rec ((L1 L1)
                 (L2 L2)
                 (o1 (- (length L1) 1)))
                (if (empty-termlist? L1)
                    (the-empty-termlist)
                    (add-terms (mul-term-by-all-terms (first-term L1) o1 L2)
                               (rec (rest-terms L1) L2 (- o1 1)))))))
    ;; c1, o1 -- coefficient, order of term to be multiplied by term list L
    ;; First multiply terms by c1, then append a list of (+ o1 1) zeros to the
    ;; end of L to represent the multiplication by the inderminate variable
    ;; raised to the power of o1.
    (define (mul-term-by-all-terms c1 o1 L)
      (define (rec c1 o1 L)
        (if (empty-termlist? L)
            (the-empty-termlist)
            (let ((t2 (first-term L)))
              (adjoin-term
               (mul c1 t2)
               (rec c1 (- o1 1) (rest-terms L))))))
      (append (rec t1 o1 L)
              (repeat 0 (+ o1 1))))
    ;; interface to rest of the system
    (define (tag p) (attach-tag 'poly-dense p))
    (put 'add '(poly-dense poly-dense)
         (lambda (p1 p2) (tag (add-poly p1 p2))))
    (put 'mul '(poly-dense poly-dense)
         (lambda (p1 p2) (tag (mul-poly p1 p2))))
    (put 'make '(poly-dense)
         (lambda (var terms) (tag (make-poly var terms))))
    'done)
#+END_SRC

