ch2/ch2.html

<div id="outline-container-orgheadline100" class="outline-5">
<h5 id="orgheadline100"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.89">Exercise 2.89.</a></h5>
<div class="outline-text-5" id="text-orgheadline100">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">install-poly-dense-package</span><span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">internal procedures</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">representation of poly</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">make-poly</span> variable term-list<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>cons variable term-list<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">variable</span> p<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>car p<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">term-list</span> p<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>cdr p<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">&lt;procedures same-variable? and variable? from section 2.3.2&gt;</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">variable?</span> x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>symbol? x<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">same-variable?</span> v1 v2<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">and</span> <span style="color: #709870;">(</span>variable? v1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>variable? v2<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>eq? v1 v2<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">representation of terms and term lists</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">&lt;procedures adjoin-term ...coeff from text below&gt;</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">adjoin-term</span> term term-list<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>=zero? term<span style="color: #709870;">)</span>
        term-list
        <span style="color: #709870;">(</span>cons term term-list<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">the-empty-termlist</span><span style="color: #909183;">)</span> '<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">first-term</span> term-list<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>car term-list<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">rest-terms</span> term-list<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>cdr term-list<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">empty-termlist?</span> term-list<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>null? term-list<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>

  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">add-poly</span> p1 p2<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>same-variable? <span style="color: #907373;">(</span>variable p1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>variable p2<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>make-poly <span style="color: #907373;">(</span>variable p1<span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>add-terms <span style="color: #6276ba;">(</span>term-list p1<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>term-list p2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"ADD-POLY -- cannot add two polynomials with different variables"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">&lt;procedures used by add-poly&gt;</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">add-terms</span> L1 L2<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span>rec <span style="color: #907373;">(</span>L1 L1<span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span>L2 L2<span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span>o1 <span style="color: #6276ba;">(</span>length L1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span>o2 <span style="color: #6276ba;">(</span>length L2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>empty-termlist? L1<span style="color: #6276ba;">)</span> L2<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>empty-termlist? L2<span style="color: #6276ba;">)</span> L1<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>&gt; o1 o2<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>adjoin-term <span style="color: #858580;">(</span>first-term L1<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>rec <span style="color: #80a880;">(</span>rest-terms L1<span style="color: #80a880;">)</span> L2 <span style="color: #80a880;">(</span>- o1 1<span style="color: #80a880;">)</span> o2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>&gt; o2 o1<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>adjoin-term <span style="color: #858580;">(</span>first-term L2<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>rec L1 <span style="color: #80a880;">(</span>rest-terms L2<span style="color: #80a880;">)</span> o1 <span style="color: #80a880;">(</span>- o2 1<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span>
             <span style="color: #6276ba;">(</span>adjoin-term <span style="color: #858580;">(</span>add <span style="color: #80a880;">(</span>first-term L1<span style="color: #80a880;">)</span>
                               <span style="color: #80a880;">(</span>first-term L2<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                          <span style="color: #858580;">(</span>rec <span style="color: #80a880;">(</span>rest-terms L1<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>rest-terms L2<span style="color: #80a880;">)</span>
                               <span style="color: #80a880;">(</span>- o1 1<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>- o2 1<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">mul-poly</span> p1 p2<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>same-variable? <span style="color: #907373;">(</span>variable p1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>variable p2<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>make-poly <span style="color: #907373;">(</span>variable p1<span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>mul-terms <span style="color: #6276ba;">(</span>term-list p1<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>term-list p2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"MUL-POLY -- cannot multiply two polynomials with different variables"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">&lt;procedures used by mul-poly&gt;</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">mul-terms</span> L1 L2<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span>rec <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>L1 L1<span style="color: #6276ba;">)</span>
               <span style="color: #6276ba;">(</span>L2 L2<span style="color: #6276ba;">)</span>
               <span style="color: #6276ba;">(</span>o1 <span style="color: #858580;">(</span>- <span style="color: #80a880;">(</span>length L1<span style="color: #80a880;">)</span> 1<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span><span style="color: #a020f0;">if</span> <span style="color: #6276ba;">(</span>empty-termlist? L1<span style="color: #6276ba;">)</span>
                  <span style="color: #6276ba;">(</span>the-empty-termlist<span style="color: #6276ba;">)</span>
                  <span style="color: #6276ba;">(</span>add-terms <span style="color: #858580;">(</span>mul-term-by-all-terms <span style="color: #80a880;">(</span>first-term L1<span style="color: #80a880;">)</span> o1 L2<span style="color: #858580;">)</span>
                             <span style="color: #858580;">(</span>rec <span style="color: #80a880;">(</span>rest-terms L1<span style="color: #80a880;">)</span> L2 <span style="color: #80a880;">(</span>- o1 1<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">c1, o1 -- coefficient, order of term to be multiplied by term list L</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">First multiply terms by c1, then append a list of (+ o1 1) zeros to the</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">end of L to represent the multiplication by the inderminate variable</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">raised to the power of o1.</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">mul-term-by-all-terms</span> c1 o1 L<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">rec</span> c1 o1 L<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>empty-termlist? L<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>the-empty-termlist<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>t2 <span style="color: #80a880;">(</span>first-term L<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>adjoin-term
             <span style="color: #858580;">(</span>mul c1 t2<span style="color: #858580;">)</span>
             <span style="color: #858580;">(</span>rec c1 <span style="color: #80a880;">(</span>- o1 1<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>rest-terms L<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>append <span style="color: #709870;">(</span>rec t1 o1 L<span style="color: #709870;">)</span>
            <span style="color: #709870;">(</span>repeat 0 <span style="color: #907373;">(</span>+ o1 1<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">interface to rest of the system</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">tag</span> p<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>attach-tag 'poly-dense p<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'add '<span style="color: #909183;">(</span>poly-dense poly-dense<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>p1 p2<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>add-poly p1 p2<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'mul '<span style="color: #909183;">(</span>poly-dense poly-dense<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>p1 p2<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>mul-poly p1 p2<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'make '<span style="color: #909183;">(</span>poly-dense<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>var terms<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>make-poly var terms<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  'done<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
