ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html\#%25_thm_2.90][Exercise 2.90.]]

We first want to define some coercions. I will use the ~get-coercion~ and
~put-coercion~ interface for this.

#+BEGIN_SRC scheme
  (include "coercion-table.scm")
  (define (coerce-poly-sparse->poly-dense p)
    (define (coeff t) (car t))
    (define (order t) (cdr t))
    (define (tag p) (attach-tag 'poly-dense p))
    (let ((terms (cdr p))
          (var (car p)))
      (cons var
            (list
             (let (rec (terms terms)
                       (o (order (car terms))))
               (cond ((null? terms)
                      '())
                     ((> o (order (car terms)))
                      (cons (attach-tag 'scheme-number 0)
                            (rec terms (- o 1))))
                     (else
                      (cons (coeff (car terms))
                            (rec terms (- o 1))))))))))
  (define (coerce-poly-dense->poly-sparse p)
    (define (make-term coeff order) (cons coeff order))
    (define (tag p) (attach-tag 'poly-dense p))
    (let ((terms (cdr p))
          (var (car p)))
      (cons var
            (list
             (let (rec (terms terms)
                       (o (- (length terms) 1)))
               (cond ((null? terms)
                      '())
                     ((=zero? (car terms))
                      (rec (cdr terms) (- o 1)))
                     (else
                      (cons (make-term (car terms) o)
                            (rec (cdr terms) (- o 1))))))))))
  (put-coercion 'poly-sparse 'poly-dense coerce-poly-sparse->poly-dense)
  (put-coercion 'poly-dense 'poly-sparse coerce-poly-dense->poly-sparse)
#+END_SRC

The idea here is to define a type ~poly-generic~, whose contents we assume are
always another tagged value (of type ~poly-sparse~ or ~poly-dense~, or perhaps
another representation that may be added in the future). Unfortunately, this
design requires manually coercing a ~poly-generic~ value to the underlying
representation, which is a major flaw the ~complex~ example doesn't have. This
arises because, unlike ~complex~, there are no primitives provided for the
polynomial types below ~add~, ~sub~, etc. with which these procedures can be
implemented.

#+BEGIN_SRC scheme
  (define (install-poly-generic-package)
    (define (tag x) (attach-tag 'poly-generic x))
    (put 'neg '(poly-generic)
         (lambda (p)
           (tag (neg (contents p)))))
    (put 'add '(poly-generic poly-generic)
         (lambda (p1 p2)
           (tag (add (contents p1) (contents p2)))))
    (put 'sub '(poly-generic poly-generic)
         (lambda (p1 p2)
           (tag (sub (contents p1) (contents p2)))))
    (put 'mul '(poly-generic poly-generic)
         (lambda (p1 p2)
           (tag (mul (contents p1) (contents p2)))))
    (put 'make '(poly-generic)
         (lambda (var terms)
           (tag ((get 'poly-sparse 'make) var terms))))
    'done)
#+END_SRC

