ch2/ch2.html

<div id="outline-container-orgheadline101" class="outline-5">
<h5 id="orgheadline101"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html%5C#%_thm_2.90">Exercise 2.90.</a></h5>
<div class="outline-text-5" id="text-orgheadline101">
<p>
We first want to define some coercions. I will use the <code>get-coercion</code> and
<code>put-coercion</code> interface for this.
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"coercion-table.scm"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">coerce-poly-sparse-&gt;poly-dense</span> p<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">coeff</span> t<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>car t<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">order</span> t<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>cdr t<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">tag</span> p<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>attach-tag 'poly-dense p<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>terms <span style="color: #907373;">(</span>cdr p<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>var <span style="color: #907373;">(</span>car p<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>cons var
          <span style="color: #709870;">(</span>list
           <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #6276ba;">(</span>rec <span style="color: #858580;">(</span>terms terms<span style="color: #858580;">)</span>
                     <span style="color: #858580;">(</span>o <span style="color: #80a880;">(</span>order <span style="color: #887070;">(</span>car terms<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>null? terms<span style="color: #80a880;">)</span>
                    '<span style="color: #80a880;">()</span><span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>&gt; o <span style="color: #887070;">(</span>order <span style="color: #707183;">(</span>car terms<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>cons <span style="color: #887070;">(</span>attach-tag 'scheme-number 0<span style="color: #887070;">)</span>
                          <span style="color: #887070;">(</span>rec terms <span style="color: #707183;">(</span>- o 1<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span><span style="color: #a020f0;">else</span>
                    <span style="color: #80a880;">(</span>cons <span style="color: #887070;">(</span>coeff <span style="color: #707183;">(</span>car terms<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                          <span style="color: #887070;">(</span>rec terms <span style="color: #707183;">(</span>- o 1<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">coerce-poly-dense-&gt;poly-sparse</span> p<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">make-term</span> coeff order<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>cons coeff order<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">tag</span> p<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>attach-tag 'poly-dense p<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>terms <span style="color: #907373;">(</span>cdr p<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>var <span style="color: #907373;">(</span>car p<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>cons var
          <span style="color: #709870;">(</span>list
           <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #6276ba;">(</span>rec <span style="color: #858580;">(</span>terms terms<span style="color: #858580;">)</span>
                     <span style="color: #858580;">(</span>o <span style="color: #80a880;">(</span>- <span style="color: #887070;">(</span>length terms<span style="color: #887070;">)</span> 1<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>null? terms<span style="color: #80a880;">)</span>
                    '<span style="color: #80a880;">()</span><span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>=zero? <span style="color: #887070;">(</span>car terms<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>rec <span style="color: #887070;">(</span>cdr terms<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>- o 1<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span><span style="color: #a020f0;">else</span>
                    <span style="color: #80a880;">(</span>cons <span style="color: #887070;">(</span>make-term <span style="color: #707183;">(</span>car terms<span style="color: #707183;">)</span> o<span style="color: #887070;">)</span>
                          <span style="color: #887070;">(</span>rec <span style="color: #707183;">(</span>cdr terms<span style="color: #707183;">)</span> <span style="color: #707183;">(</span>- o 1<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put-coercion 'poly-sparse 'poly-dense coerce-poly-sparse-&gt;poly-dense<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put-coercion 'poly-dense 'poly-sparse coerce-poly-dense-&gt;poly-sparse<span style="color: #707183;">)</span>
</pre>
</div>

<p>
The idea here is to define a type <code>poly-generic</code>, whose contents we assume are
always another tagged value (of type <code>poly-sparse</code> or <code>poly-dense</code>, or perhaps
another representation that may be added in the future). Unfortunately, this
design requires manually coercing a <code>poly-generic</code> value to the underlying
representation, which is a major flaw the <code>complex</code> example doesn't have. This
arises because, unlike <code>complex</code>, there are no primitives provided for the
polynomial types below <code>add</code>, <code>sub</code>, etc. with which these procedures can be
implemented.
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">install-poly-generic-package</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">tag</span> x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>attach-tag 'poly-generic x<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'neg '<span style="color: #909183;">(</span>poly-generic<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>p<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>neg <span style="color: #6276ba;">(</span>contents p<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'add '<span style="color: #909183;">(</span>poly-generic poly-generic<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>p1 p2<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>add <span style="color: #6276ba;">(</span>contents p1<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>contents p2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'sub '<span style="color: #909183;">(</span>poly-generic poly-generic<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>p1 p2<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>sub <span style="color: #6276ba;">(</span>contents p1<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>contents p2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'mul '<span style="color: #909183;">(</span>poly-generic poly-generic<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>p1 p2<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>mul <span style="color: #6276ba;">(</span>contents p1<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>contents p2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'make '<span style="color: #909183;">(</span>poly-generic<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>var terms<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>get 'poly-sparse 'make<span style="color: #6276ba;">)</span> var terms<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  'done<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
