ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.91][Exercise 2.91.]]

#+NAME: poly-sparse-div-terms
#+BEGIN_SRC scheme :tangle ex-2-91-division.scm
  (define (div-terms L1 L2)
    (if (empty-termlist? L1)
        (list (the-empty-termlist) (the-empty-termlist))
        (let ((t1 (first-term L1))
              (t2 (first-term L2)))
          (if (> (order t2) (order t1))
              (list (the-empty-termlist) L1)
              (let ((new-c (div (coeff t1) (coeff t2)))
                    (new-o (- (order t1) (order t2))))
                (let ((rest-of-result
                       (div-terms
                        (sub-terms L1
                                   (mul-terms (list (make-term new-o new-c))
                                              L2))
                        L2)))
                  (list (adjoin-term (make-term new-o new-c)
                                     (list-ref rest-of-result 0))
                        (list-ref rest-of-result 1))))))))
#+END_SRC

#+NAME: ex-2-91-div-poly-sparse
#+BEGIN_SRC scheme
  (define (div-poly-sparse p1 p2)
    (if (same-variable? (variable p1)
                        (variable p2))
        (letrec ((var (variable p1))
                 (result (div-terms (term-list p1)
                                    (term-list p2)))
                 (quotient (list-ref result 0))
                 (remainder (list-ref result 1)))
          (list (make-poly-sparse var quotient)
                (make-poly-sparse var remainder)))
        (error "DIV-POLY-SPARSE -- division between different variables NYI")))
  (put 'div '(poly-sparse poly-sparse)
       (lambda (p1 p2) (map tag (div-poly-sparse p1 p2))))
#+END_SRC

#+NAME: ex-2-91-test
#+BEGIN_SRC scheme :tangle ex-2-91-test.scm
  (use test)
  (include "poly-sparse-package.scm")
  (define tl1 '((5 1) (0 -1)))
  (define tl2 '((2 1) (0 -1)))
  (define p1 (make-poly-sparse 'x tl1))
  (define p2 (make-poly-sparse 'x tl2))
  (define result-quotient (make-poly-sparse 'x '((3 1) (1 1))))
  (define result-remainder (make-poly-sparse 'x '((1 1) (0 -1))))
  (test (list result-quotient result-remainder)
        (div p1 p2))
#+END_SRC

**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.92][Exercise 2.92.]]

Skipping.

