ch2/ch2.html

<div id="outline-container-orgheadline102" class="outline-5">
<h5 id="orgheadline102"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.91">Exercise 2.91.</a></h5>
<div class="outline-text-5" id="text-orgheadline102">
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock24"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">div-terms</span> L1 L2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>empty-termlist? L1<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>list <span style="color: #709870;">(</span>the-empty-termlist<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>the-empty-termlist<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>t1 <span style="color: #6276ba;">(</span>first-term L1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>t2 <span style="color: #6276ba;">(</span>first-term L2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>&gt; <span style="color: #6276ba;">(</span>order t2<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>order t1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>list <span style="color: #6276ba;">(</span>the-empty-termlist<span style="color: #6276ba;">)</span> L1<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>new-c <span style="color: #80a880;">(</span>div <span style="color: #887070;">(</span>coeff t1<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>coeff t2<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span>new-o <span style="color: #80a880;">(</span>- <span style="color: #887070;">(</span>order t1<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>order t2<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #a020f0;">let</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>rest-of-result
                     <span style="color: #887070;">(</span>div-terms
                      <span style="color: #707183;">(</span>sub-terms L1
                                 <span style="color: #7388d6;">(</span>mul-terms <span style="color: #909183;">(</span>list <span style="color: #709870;">(</span>make-term new-o new-c<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                                            L2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                      L2<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                <span style="color: #858580;">(</span>list <span style="color: #80a880;">(</span>adjoin-term <span style="color: #887070;">(</span>make-term new-o new-c<span style="color: #887070;">)</span>
                                   <span style="color: #887070;">(</span>list-ref rest-of-result 0<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                      <span style="color: #80a880;">(</span>list-ref rest-of-result 1<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock25"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">div-poly-sparse</span> p1 p2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>same-variable? <span style="color: #709870;">(</span>variable p1<span style="color: #709870;">)</span>
                      <span style="color: #709870;">(</span>variable p2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">letrec</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>var <span style="color: #6276ba;">(</span>variable p1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
               <span style="color: #907373;">(</span>result <span style="color: #6276ba;">(</span>div-terms <span style="color: #858580;">(</span>term-list p1<span style="color: #858580;">)</span>
                                  <span style="color: #858580;">(</span>term-list p2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
               <span style="color: #907373;">(</span>quotient <span style="color: #6276ba;">(</span>list-ref result 0<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
               <span style="color: #907373;">(</span>remainder <span style="color: #6276ba;">(</span>list-ref result 1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>list <span style="color: #907373;">(</span>make-poly-sparse var quotient<span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span>make-poly-sparse var remainder<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"DIV-POLY-SPARSE -- division between different variables NYI"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'div '<span style="color: #7388d6;">(</span>poly-sparse poly-sparse<span style="color: #7388d6;">)</span>
     <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>p1 p2<span style="color: #909183;">)</span> <span style="color: #909183;">(</span><span style="color: #a020f0;">map</span> tag <span style="color: #709870;">(</span>div-poly-sparse p1 p2<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock26"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"poly-sparse-package.scm"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">tl1</span> '<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>5 1<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>0 -1<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">tl2</span> '<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>2 1<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>0 -1<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p1</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x tl1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p2</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x tl2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">result-quotient</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>3 1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>1 1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">result-remainder</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>1 1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>0 -1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test <span style="color: #7388d6;">(</span>list result-quotient result-remainder<span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span>div p1 p2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
