ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.93][Exercise 2.93.]]

#+BEGIN_SRC scheme :tangle rational-package.scm
  (include "dispatch-table")
  (include "generic-zero")
  (include "generic-neg")
  (define (install-rational-package)
    ;; internal procedures
    (define (numer x) (list-ref x 0))
    (define (denom x) (list-ref x 1))
    (define (make-rat n d)
      (list n d))

    (define (=zero?-rat x y)
      (and (= (numer x) 0)
           ;; Denominator of 0 is undefined -- choose not to make such a number
           ;; equal to 0 even if the numerator is 0.
           (not (= (denom x) 0))))
    (define (neg-rat x)
      (make-rat (neg (numer x)) (denom x)))
    (define (add-rat x y)
      (make-rat (add (mul (numer x) (denom y))
                     (mul (numer y) (denom x)))
                (mul (denom x) (denom y))))
    (define (sub-rat x y)
      (make-rat (sub (mul (numer x) (denom y))
                     (mul (numer y) (denom x)))
                (mul (denom x) (denom y))))
    (define (mul-rat x y)
      (make-rat (mul (numer x) (numer y))
                (mul (denom x) (denom y))))
    (define (div-rat x y)
      (make-rat (mul (numer x) (denom y))
                (mul (denom x) (numer y))))
    ;; interface to rest of the system
    (define (tag x) (attach-tag 'rational x))
    (put '=zero? '(rational) =zero?-rat)
    (put 'neg '(rational) neg-rat)
    (put 'add '(rational rational)
         (lambda (x y) (tag (add-rat x y))))
    (put 'sub '(rational rational)
         (lambda (x y) (tag (sub-rat x y))))
    (put 'mul '(rational rational)
         (lambda (x y) (tag (mul-rat x y))))
    (put 'div '(rational rational)
         (lambda (x y) (tag (div-rat x y))))
  
    (put 'make 'rational
         (lambda (n d) (tag (make-rat n d))))
    'done)
  (install-rational-package)
  (define (make-rational n d)
    ((get 'make 'rational) n d))
#+END_SRC


#+BEGIN_SRC scheme :tangle ex-2-93-test.scm
  (include "poly-sparse-package")
  (include "rational-package")
  (define p1 (make-poly-sparse 'x '((2 1)(0 1))))
  (define p2 (make-poly-sparse 'x '((3 1)(0 1))))
  (define rf (make-rational p2 p1))
  (define result (make-rational (make-poly-sparse 'x '((5 2) (3 2) (2 2) (0 2)))
                                (make-poly-sparse 'x '((4 1) (2 2) (0 1)))))
  (test result
        (add rf rf))
#+END_SRC

