ch2/ch2.html

<div id="outline-container-orgheadline103" class="outline-5">
<h5 id="orgheadline103"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.92">Exercise 2.92.</a></h5>
<div class="outline-text-5" id="text-orgheadline103">
<p>
Skipping.
</p>
</div>
</div>

<div id="outline-container-orgheadline104" class="outline-5">
<h5 id="orgheadline104"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.93">Exercise 2.93.</a></h5>
<div class="outline-text-5" id="text-orgheadline104">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"dispatch-table"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"generic-zero"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"generic-neg"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">install-rational-package</span><span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">internal procedures</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">numer</span> x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>list-ref x 0<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">denom</span> x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>list-ref x 1<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">make-rat</span> n d<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>list n d<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>

  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">=zero?-rat</span> x y<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">and</span> <span style="color: #709870;">(</span>= <span style="color: #907373;">(</span>numer x<span style="color: #907373;">)</span> 0<span style="color: #709870;">)</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">Denominator of 0 is undefined -- choose not to make such a number</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">equal to 0 even if the numerator is 0.</span>
         <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>= <span style="color: #6276ba;">(</span>denom x<span style="color: #6276ba;">)</span> 0<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">neg-rat</span> x<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>make-rat <span style="color: #709870;">(</span>neg <span style="color: #907373;">(</span>numer x<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>denom x<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">add-rat</span> x y<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>make-rat <span style="color: #709870;">(</span>add <span style="color: #907373;">(</span>mul <span style="color: #6276ba;">(</span>numer x<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>denom y<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>mul <span style="color: #6276ba;">(</span>numer y<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>denom x<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
              <span style="color: #709870;">(</span>mul <span style="color: #907373;">(</span>denom x<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>denom y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">sub-rat</span> x y<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>make-rat <span style="color: #709870;">(</span>sub <span style="color: #907373;">(</span>mul <span style="color: #6276ba;">(</span>numer x<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>denom y<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                   <span style="color: #907373;">(</span>mul <span style="color: #6276ba;">(</span>numer y<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>denom x<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
              <span style="color: #709870;">(</span>mul <span style="color: #907373;">(</span>denom x<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>denom y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">mul-rat</span> x y<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>make-rat <span style="color: #709870;">(</span>mul <span style="color: #907373;">(</span>numer x<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>numer y<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
              <span style="color: #709870;">(</span>mul <span style="color: #907373;">(</span>denom x<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>denom y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">div-rat</span> x y<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>make-rat <span style="color: #709870;">(</span>mul <span style="color: #907373;">(</span>numer x<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>denom y<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
              <span style="color: #709870;">(</span>mul <span style="color: #907373;">(</span>denom x<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>numer y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">interface to rest of the system</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">tag</span> x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>attach-tag 'rational x<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put '=zero? '<span style="color: #909183;">(</span>rational<span style="color: #909183;">)</span> =zero?-rat<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'neg '<span style="color: #909183;">(</span>rational<span style="color: #909183;">)</span> neg-rat<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'add '<span style="color: #909183;">(</span>rational rational<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x y<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>add-rat x y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'sub '<span style="color: #909183;">(</span>rational rational<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x y<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>sub-rat x y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'mul '<span style="color: #909183;">(</span>rational rational<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x y<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>mul-rat x y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put 'div '<span style="color: #909183;">(</span>rational rational<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x y<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>div-rat x y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>

  <span style="color: #7388d6;">(</span>put 'make 'rational
       <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>n d<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>tag <span style="color: #907373;">(</span>make-rat n d<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  'done<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>install-rational-package<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-rational</span> n d<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>get 'make 'rational<span style="color: #909183;">)</span> n d<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>


<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"poly-sparse-package"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"rational-package"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p1</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>2 1<span style="color: #709870;">)(</span>0 1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p2</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>3 1<span style="color: #709870;">)(</span>0 1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">rf</span> <span style="color: #7388d6;">(</span>make-rational p2 p1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">result</span> <span style="color: #7388d6;">(</span>make-rational <span style="color: #909183;">(</span>make-poly-sparse 'x '<span style="color: #709870;">(</span><span style="color: #907373;">(</span>5 2<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>3 2<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>2 2<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>0 2<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                              <span style="color: #909183;">(</span>make-poly-sparse 'x '<span style="color: #709870;">(</span><span style="color: #907373;">(</span>4 1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>2 2<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>0 1<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test result
      <span style="color: #7388d6;">(</span>add rf rf<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
