ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%25_thm_2.94][Exercise 2.94.]]

#+NAME: ex-2-94-terms
#+BEGIN_SRC scheme
  (define (remainder-terms L1 L2)
    (list-ref (div-terms L1 L2) 1))
  (define (gcd-terms a b)
    (if (empty-termlist? b)
        a
        (gcd-terms b (remainder-terms a b))))
#+END_SRC

#+NAME: ex-2-94-gcd-poly-sparse
#+BEGIN_SRC scheme
  (define (gcd-poly-sparse p1 p2)
    (if (same-variable? (variable p1)
                        (variable p2))
        (letrec ((var (variable p1))
                 (result (gcd-terms (term-list p1)
                                    (term-list p2))))
          (make-poly-sparse var result))
        (error "GCD-POLY -- GCD between different variables NYI")))
  (put 'greatest-common-divisor '(poly-sparse poly-sparse)
       (lambda (x y) (tag (gcd-poly-sparse x y))))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-2-94-test.scm
  (use test)
  (include "poly-sparse-package")
  (define p1 (make-poly-sparse 'x '((4 1) (3 -1) (2 -2) (1 2))))
  (define p2 (make-poly-sparse 'x '((3 1) (1 -1))))
  (define gcd (make-poly-sparse 'x '((2 -1) (1 1))))
  (test gcd
        (apply-generic 'greatest-common-divisor p1 p2))
#+END_SRC

**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%25_thm_2.95][Exercise 2.95.]]

#+BEGIN_SRC scheme :tangle ex-2-95-test.scm
  (use test)
  (include "poly-sparse-package")
  (define p1 (make-poly-sparse 'x '((2 1) (1 -2) (0 1))))
  (define p2 (make-poly-sparse 'x '((2 11) (0 7))))
  (define p3 (make-poly-sparse 'x '((1 13) (0 5))))
  (define q1 (mul p1 p2))
  (define q2 (mul p1 p3))
  (parameterize ((test-epsilon 0.01))
                (test '(0 1.10004)
                      (caddr (apply-generic 'greatest-common-divisor q1 q2))))
#+END_SRC

