ch2/ch2.html

<div id="outline-container-orgheadline105" class="outline-5">
<h5 id="orgheadline105"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.94">Exercise 2.94.</a></h5>
<div class="outline-text-5" id="text-orgheadline105">
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock27"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">remainder-terms</span> L1 L2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>list-ref <span style="color: #909183;">(</span>div-terms L1 L2<span style="color: #909183;">)</span> 1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">gcd-terms</span> a b<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>empty-termlist? b<span style="color: #909183;">)</span>
      a
      <span style="color: #909183;">(</span>gcd-terms b <span style="color: #709870;">(</span>remainder-terms a b<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock28"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">gcd-poly-sparse</span> p1 p2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>same-variable? <span style="color: #709870;">(</span>variable p1<span style="color: #709870;">)</span>
                      <span style="color: #709870;">(</span>variable p2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">letrec</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>var <span style="color: #6276ba;">(</span>variable p1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
               <span style="color: #907373;">(</span>result <span style="color: #6276ba;">(</span>gcd-terms <span style="color: #858580;">(</span>term-list p1<span style="color: #858580;">)</span>
                                  <span style="color: #858580;">(</span>term-list p2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>make-poly-sparse var result<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"GCD-POLY -- GCD between different variables NYI"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'greatest-common-divisor '<span style="color: #7388d6;">(</span>poly-sparse poly-sparse<span style="color: #7388d6;">)</span>
     <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x y<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>tag <span style="color: #709870;">(</span>gcd-poly-sparse x y<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"poly-sparse-package"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p1</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>4 1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>3 -1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>2 -2<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>1 2<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p2</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>3 1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>1 -1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">gcd</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>2 -1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>1 1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test gcd
      <span style="color: #7388d6;">(</span>apply-generic 'greatest-common-divisor p1 p2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline106" class="outline-5">
<h5 id="orgheadline106"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.95">Exercise 2.95.</a></h5>
<div class="outline-text-5" id="text-orgheadline106">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"poly-sparse-package"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p1</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>2 1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>1 -2<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>0 1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p2</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>2 11<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>0 7<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p3</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>1 13<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>0 5<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">q1</span> <span style="color: #7388d6;">(</span>mul p1 p2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">q2</span> <span style="color: #7388d6;">(</span>mul p1 p3<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">parameterize</span> <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>test-epsilon 0.01<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
              <span style="color: #7388d6;">(</span>test '<span style="color: #909183;">(</span>0 1.10004<span style="color: #909183;">)</span>
                    <span style="color: #909183;">(</span>caddr <span style="color: #709870;">(</span>apply-generic 'greatest-common-divisor q1 q2<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
