ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%25_thm_2.96][Exercise 2.96.]]

a. Pseudoremainder

#+NAME: ex-2-96-improved-terms
#+BEGIN_SRC scheme
  (define (pseudoremainder-terms L1 L2)
    (letrec ((integerizing-factor (expt (coeff (first-term L2))
                                        (+ 1 (- (order (first-term L1))
                                                (order (first-term L2))))))
             (dividend (mul-terms L1 `((0 ,integerizing-factor)))))
      (list-ref (div-terms dividend L2) 1)))
  (define (improved-gcd-terms a b)
    (if (empty-termlist? b)
        a
        (gcd-terms b (pseudoremainder-terms a b))))
#+END_SRC

#+NAME: ex-2-96-improved-gcd-poly-sparse
#+BEGIN_SRC scheme
  (define (improved-gcd-poly-sparse p1 p2)
    (if (same-variable? (variable p1)
                        (variable p2))
        (letrec ((var (variable p1))
                 (result (improved-gcd-terms (term-list p1)
                                             (term-list p2))))
          (make-poly-sparse var result))
        (error "GCD-POLY -- GCD between different variables NYI")))
  (put 'improved-greatest-common-divisor '(poly-sparse poly-sparse)
       (lambda (x y) (tag (improved-gcd-poly-sparse x y))))
#+END_SRC


b. Reduce to lowest terms

#+NAME: ex-2-96-gcd-integer
#+BEGIN_SRC scheme
  (define (gcd a . terms)
    (define (gcd-dyadic a b)
      (if (= b 0)
          a
          (gcd-dyadic b (remainder a b))))
    (fold gcd-dyadic 0 (append (list a) terms)))
#+END_SRC

#+NAME: ex-2-96-reimproved-terms
#+BEGIN_SRC scheme
  <<ex-2-96-gcd-integer>>
  (define (reimproved-gcd-terms a b)
    (define (rec a b)
      (if (empty-termlist? b)
          a
          (gcd-terms b (pseudoremainder-terms a b))))
    (letrec ((gcd-terms-result (rec a b))
             (common-coeff (apply gcd (map coeff gcd-terms-result))))
      (div-terms gcd-terms-result (list (make-term 0 common-coeff)))))
#+END_SRC

#+NAME: ex-2-96-reimproved-gcd-poly-sparse
#+BEGIN_SRC scheme
  (define (reimproved-gcd-poly-sparse p1 p2)
    (if (same-variable? (variable p1)
                        (variable p2))
        (letrec ((var (variable p1))
                 (result (reimproved-gcd-terms (term-list p1)
                                               (term-list p2))))
          (make-poly-sparse var result))
        (error "GCD-POLY -- GCD between different variables NYI")))
  (put 'reimproved-greatest-common-divisor '(poly-sparse poly-sparse)
       (lambda (x y) (tag (reimproved-gcd-poly-sparse x y))))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-2-96-test.scm
  (use test)
  (include "poly-sparse-package")
  (define p1 (make-poly-sparse 'x '((2 1) (1 -2) (0 1))))
  (define p2 (make-poly-sparse 'x '((2 11) (0 7))))
  (define p3 (make-poly-sparse 'x '((1 13) (0 5))))
  (define q1 (mul p1 p2))
  (define q2 (mul p1 p3))
  (define improved-result (make-poly-sparse 'x '((2 1458) (1 -2916) (0 1458))))
  (test improved-result
        (apply-generic 'improved-greatest-common-divisor q1 q2))
  (define reimproved-result (make-poly-sparse 'x '((2 1) (1 -2) (0 1))))
  (test reimproved-result
        (apply-generic 'reimproved-greatest-common-divisor q1 q2))
#+END_SRC

