ch2/ch2.html

<div id="outline-container-orgheadline107" class="outline-5">
<h5 id="orgheadline107"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.96">Exercise 2.96.</a></h5>
<div class="outline-text-5" id="text-orgheadline107">
<ol class="org-ol">
<li>Pseudoremainder</li>
</ol>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock29"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">pseudoremainder-terms</span> L1 L2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">letrec</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>integerizing-factor <span style="color: #907373;">(</span>expt <span style="color: #6276ba;">(</span>coeff <span style="color: #858580;">(</span>first-term L2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                                      <span style="color: #6276ba;">(</span>+ 1 <span style="color: #858580;">(</span>- <span style="color: #80a880;">(</span>order <span style="color: #887070;">(</span>first-term L1<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                                              <span style="color: #80a880;">(</span>order <span style="color: #887070;">(</span>first-term L2<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
           <span style="color: #709870;">(</span>dividend <span style="color: #907373;">(</span>mul-terms L1 `<span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>0 ,integerizing-factor<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>list-ref <span style="color: #709870;">(</span>div-terms dividend L2<span style="color: #709870;">)</span> 1<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">improved-gcd-terms</span> a b<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>empty-termlist? b<span style="color: #909183;">)</span>
      a
      <span style="color: #909183;">(</span>gcd-terms b <span style="color: #709870;">(</span>pseudoremainder-terms a b<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock30"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">improved-gcd-poly-sparse</span> p1 p2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>same-variable? <span style="color: #709870;">(</span>variable p1<span style="color: #709870;">)</span>
                      <span style="color: #709870;">(</span>variable p2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">letrec</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>var <span style="color: #6276ba;">(</span>variable p1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
               <span style="color: #907373;">(</span>result <span style="color: #6276ba;">(</span>improved-gcd-terms <span style="color: #858580;">(</span>term-list p1<span style="color: #858580;">)</span>
                                           <span style="color: #858580;">(</span>term-list p2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>make-poly-sparse var result<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"GCD-POLY -- GCD between different variables NYI"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'improved-greatest-common-divisor '<span style="color: #7388d6;">(</span>poly-sparse poly-sparse<span style="color: #7388d6;">)</span>
     <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x y<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>tag <span style="color: #709870;">(</span>improved-gcd-poly-sparse x y<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>


<ol class="org-ol">
<li>Reduce to lowest terms</li>
</ol>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock31"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">gcd</span> a . terms<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">gcd-dyadic</span> a b<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>= b 0<span style="color: #709870;">)</span>
        a
        <span style="color: #709870;">(</span>gcd-dyadic b <span style="color: #907373;">(</span>remainder a b<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>fold gcd-dyadic 0 <span style="color: #909183;">(</span>append <span style="color: #709870;">(</span>list a<span style="color: #709870;">)</span> terms<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock32"><span style="color: #228b22;">&lt;&lt;ex-2-96-gcd-integer&gt;&gt;</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">reimproved-gcd-terms</span> a b<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">rec</span> a b<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>empty-termlist? b<span style="color: #709870;">)</span>
        a
        <span style="color: #709870;">(</span>gcd-terms b <span style="color: #907373;">(</span>pseudoremainder-terms a b<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">letrec</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>gcd-terms-result <span style="color: #907373;">(</span>rec a b<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
           <span style="color: #709870;">(</span>common-coeff <span style="color: #907373;">(</span>apply gcd <span style="color: #6276ba;">(</span><span style="color: #a020f0;">map</span> coeff gcd-terms-result<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>div-terms gcd-terms-result <span style="color: #709870;">(</span>list <span style="color: #907373;">(</span>make-term 0 common-coeff<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock33"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">reimproved-gcd-poly-sparse</span> p1 p2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>same-variable? <span style="color: #709870;">(</span>variable p1<span style="color: #709870;">)</span>
                      <span style="color: #709870;">(</span>variable p2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">letrec</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>var <span style="color: #6276ba;">(</span>variable p1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
               <span style="color: #907373;">(</span>result <span style="color: #6276ba;">(</span>reimproved-gcd-terms <span style="color: #858580;">(</span>term-list p1<span style="color: #858580;">)</span>
                                             <span style="color: #858580;">(</span>term-list p2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>make-poly-sparse var result<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"GCD-POLY -- GCD between different variables NYI"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'reimproved-greatest-common-divisor '<span style="color: #7388d6;">(</span>poly-sparse poly-sparse<span style="color: #7388d6;">)</span>
     <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x y<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>tag <span style="color: #709870;">(</span>reimproved-gcd-poly-sparse x y<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"poly-sparse-package"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p1</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>2 1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>1 -2<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>0 1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p2</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>2 11<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>0 7<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p3</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>1 13<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>0 5<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">q1</span> <span style="color: #7388d6;">(</span>mul p1 p2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">q2</span> <span style="color: #7388d6;">(</span>mul p1 p3<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">improved-result</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>2 1458<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>1 -2916<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>0 1458<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test improved-result
      <span style="color: #7388d6;">(</span>apply-generic 'improved-greatest-common-divisor q1 q2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">reimproved-result</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>2 1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>1 -2<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>0 1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test reimproved-result
      <span style="color: #7388d6;">(</span>apply-generic 'reimproved-greatest-common-divisor q1 q2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
