ch2/ch2.org
**** [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%25_thm_2.97][Exercise 2.97.]]

#+BEGIN_SRC scheme
  (define (reduce-integers n d)
    (let ((g (gcd n d)))
      (list (/ n g) (/ d g))))
#+END_SRC

#+BEGIN_SRC scheme
  (define (reduce n d)
    (lambda (n d) (apply-generic 'reduce n d)))
#+END_SRC

#+NAME: poly-sparse-reduce-terms
#+BEGIN_SRC scheme
  (define (reduce-terms n d)
    (define (scalar-terms c) (list (make-term 0 c)))
    (letrec (
             ;; Compute GCD of terms using code from Exercise 2.96
             (gcd-n-d (reimproved-gcd-terms n d))
             ;; Multiply numerator and denominator by integerizing factor before
             ;; dividing both by GCD to ensure no noninteger coefficients are
             ;; introduced.
             (integerizing-factor (expt (coeff (first-term gcd-n-d))
                                        (+ 1 (- (max (order (first-term n))
                                                     (order (first-term d)))
                                                (order (first-term gcd-n-d))))))
             (n-integerized (mul-terms n (scalar-terms integerizing-factor)))
             (d-integerized (mul-terms d (scalar-terms integerizing-factor)))
             (n-reduced (div-terms n-integerized gcd-n-d))
             (d-reduced (div-terms d-integerized gcd-n-d)))
      (begin
        ;; Division by GCD of numerator and denominator should produce no
        ;; remainder by definition.
        (define (quotient-terms x) (list-ref x 0))
        (define (remainder-terms x) (list-ref x 1))
        (assert (empty-termlist? (remainder-terms n-reduced)))
        (assert (empty-termlist? (remainder-terms d-reduced)))
        (letrec ((gcd-coeffs (apply gcd (append (map coeff (quotient-terms n-reduced))
                                                (map coeff (quotient-terms d-reduced)))))
                 (nn (div-terms n-reduced (scalar-terms gcd-coeffs)))
                 (dd (div-terms d-reduced (scalar-terms gcd-coeffs))))
          (list nn dd)))))
#+END_SRC

#+NAME: poly-sparse-reduce
#+BEGIN_SRC scheme
  (define (reduce-poly-sparse p1 p2)
    (if (same-variable? (variable p1) (variable p2))
        (map (lambda (p) (make-poly-sparse (variable p1) p))
             (reduce-terms (term-list p1) (term-list p2)))
        (error "REDUCE-POLY -- cannot reduce two polynomials with different variables")))
  (put 'reduce '(poly-sparse poly-sparse)
       (lambda (x y) (tag (reduce-poly-sparse x y))))
#+END_SRC

#+NAME: ex-2-97-reduce-integers
#+BEGIN_SRC scheme
  (define (reduce-integers n d)
    <<ex-2-96-gcd-integers>>
    (let ((g (gcd n d)))
      (list (/ n g) (/ d g))))
  (put 'reduce '(scheme-number scheme-number)
       (lambda (x y) (attach-tag 'scheme-number (reduce-integers x y))))
#+END_SRC

#+BEGIN_SRC scheme :tangle generic-reduce.scm
  (include "dispatch-table.scm")
  <<ex-2-97-reduce-integers>>
  (define (reduce x y) (apply-generic 'reduce x y))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-2-97-test.scm
  (use test)
  (include "poly-sparse-package")
  (include "rational-package")
  (define p1 (make-poly-sparse 'x '((1 1)(0 1))))
  (define p2 (make-poly-sparse 'x '((3 1)(0 -1))))
  (define p3 (make-poly-sparse 'x '((1 1))))
  (define p4 (make-poly-sparse 'x '((2 1)(0 -1))))

  (define rf1 (make-rational p1 p2))
  (define rf2 (make-rational p3 p4))

  (define result (make-rational (make-poly-sparse 'x '((4 1) (3 1) (2 1) (1 -2) (0 -1)))
                                (make-poly-sparse 'x '((5 1) (3 -1) (2 -1) (0 1)))))
  (test result
        (add rf1 rf2))
#+END_SRC
