ch2/ch2.html

<div id="outline-container-orgheadline108" class="outline-5">
<h5 id="orgheadline108"><a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-17.html#%_thm_2.97">Exercise 2.97.</a></h5>
<div class="outline-text-5" id="text-orgheadline108">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">reduce-integers</span> n d<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>g <span style="color: #907373;">(</span>gcd n d<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>list <span style="color: #709870;">(</span>/ n g<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>/ d g<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">reduce</span> n d<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>n d<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>apply-generic 'reduce n d<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock34"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">reduce-terms</span> n d<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">scalar-terms</span> c<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>list <span style="color: #709870;">(</span>make-term 0 c<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">letrec</span> <span style="color: #909183;">(</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">Compute GCD of terms using code from Exercise 2.96</span>
           <span style="color: #709870;">(</span>gcd-n-d <span style="color: #907373;">(</span>reimproved-gcd-terms n d<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">Multiply numerator and denominator by integerizing factor before</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">dividing both by GCD to ensure no noninteger coefficients are</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">introduced.</span>
           <span style="color: #709870;">(</span>integerizing-factor <span style="color: #907373;">(</span>expt <span style="color: #6276ba;">(</span>coeff <span style="color: #858580;">(</span>first-term gcd-n-d<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                                      <span style="color: #6276ba;">(</span>+ 1 <span style="color: #858580;">(</span>- <span style="color: #80a880;">(</span>max <span style="color: #887070;">(</span>order <span style="color: #707183;">(</span>first-term n<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                                                   <span style="color: #887070;">(</span>order <span style="color: #707183;">(</span>first-term d<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                                              <span style="color: #80a880;">(</span>order <span style="color: #887070;">(</span>first-term gcd-n-d<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
           <span style="color: #709870;">(</span>n-integerized <span style="color: #907373;">(</span>mul-terms n <span style="color: #6276ba;">(</span>scalar-terms integerizing-factor<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
           <span style="color: #709870;">(</span>d-integerized <span style="color: #907373;">(</span>mul-terms d <span style="color: #6276ba;">(</span>scalar-terms integerizing-factor<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
           <span style="color: #709870;">(</span>n-reduced <span style="color: #907373;">(</span>div-terms n-integerized gcd-n-d<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
           <span style="color: #709870;">(</span>d-reduced <span style="color: #907373;">(</span>div-terms d-integerized gcd-n-d<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">begin</span>
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">Division by GCD of numerator and denominator should produce no</span>
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">remainder by definition.</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">define</span> <span style="color: #907373;">(</span><span style="color: #0000ff;">quotient-terms</span> x<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>list-ref x 0<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">define</span> <span style="color: #907373;">(</span><span style="color: #0000ff;">remainder-terms</span> x<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>list-ref x 1<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>assert <span style="color: #907373;">(</span>empty-termlist? <span style="color: #6276ba;">(</span>remainder-terms n-reduced<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>assert <span style="color: #907373;">(</span>empty-termlist? <span style="color: #6276ba;">(</span>remainder-terms d-reduced<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">letrec</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>gcd-coeffs <span style="color: #858580;">(</span>apply gcd <span style="color: #80a880;">(</span>append <span style="color: #887070;">(</span><span style="color: #a020f0;">map</span> coeff <span style="color: #707183;">(</span>quotient-terms n-reduced<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                                              <span style="color: #887070;">(</span><span style="color: #a020f0;">map</span> coeff <span style="color: #707183;">(</span>quotient-terms d-reduced<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
               <span style="color: #6276ba;">(</span>nn <span style="color: #858580;">(</span>div-terms n-reduced <span style="color: #80a880;">(</span>scalar-terms gcd-coeffs<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
               <span style="color: #6276ba;">(</span>dd <span style="color: #858580;">(</span>div-terms d-reduced <span style="color: #80a880;">(</span>scalar-terms gcd-coeffs<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>list nn dd<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock35"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">reduce-poly-sparse</span> p1 p2<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>same-variable? <span style="color: #709870;">(</span>variable p1<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>variable p2<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">map</span> <span style="color: #709870;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #907373;">(</span>p<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>make-poly-sparse <span style="color: #6276ba;">(</span>variable p1<span style="color: #6276ba;">)</span> p<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
           <span style="color: #709870;">(</span>reduce-terms <span style="color: #907373;">(</span>term-list p1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>term-list p2<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>error <span style="color: #8b2252;">"REDUCE-POLY -- cannot reduce two polynomials with different variables"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'reduce '<span style="color: #7388d6;">(</span>poly-sparse poly-sparse<span style="color: #7388d6;">)</span>
     <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x y<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>tag <span style="color: #709870;">(</span>reduce-poly-sparse x y<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock36"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">reduce-integers</span> n d<span style="color: #7388d6;">)</span>
  <span style="color: #228b22;">&lt;&lt;ex-2-96-gcd-integers&gt;&gt;</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>g <span style="color: #907373;">(</span>gcd n d<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>list <span style="color: #709870;">(</span>/ n g<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>/ d g<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>put 'reduce '<span style="color: #7388d6;">(</span>scheme-number scheme-number<span style="color: #7388d6;">)</span>
     <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x y<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>attach-tag 'scheme-number <span style="color: #709870;">(</span>reduce-integers x y<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"dispatch-table.scm"</span><span style="color: #707183;">)</span>
<span style="color: #228b22;">&lt;&lt;ex-2-97-reduce-integers&gt;&gt;</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">reduce</span> x y<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>apply-generic 'reduce x y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"poly-sparse-package"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"rational-package"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p1</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>1 1<span style="color: #709870;">)(</span>0 1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p2</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>3 1<span style="color: #709870;">)(</span>0 -1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p3</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>1 1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">p4</span> <span style="color: #7388d6;">(</span>make-poly-sparse 'x '<span style="color: #909183;">(</span><span style="color: #709870;">(</span>2 1<span style="color: #709870;">)(</span>0 -1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">rf1</span> <span style="color: #7388d6;">(</span>make-rational p1 p2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">rf2</span> <span style="color: #7388d6;">(</span>make-rational p3 p4<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">result</span> <span style="color: #7388d6;">(</span>make-rational <span style="color: #909183;">(</span>make-poly-sparse 'x '<span style="color: #709870;">(</span><span style="color: #907373;">(</span>4 1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>3 1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>2 1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>1 -2<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>0 -1<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                              <span style="color: #909183;">(</span>make-poly-sparse 'x '<span style="color: #709870;">(</span><span style="color: #907373;">(</span>5 1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>3 -1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>2 -1<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>0 1<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test result
      <span style="color: #7388d6;">(</span>add rf1 rf2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Robert Irelan</p>
<p class="email">Email: <a href="mailto:rirelan@gmail.com">rirelan@gmail.com</a></p>
<p class="date">Created: 2015-08-28 Fri 08:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
